*** src/proto/single/cmd.rs:215:9: replace Hello::set_password with ()

*** mutation diff:
--- src/proto/single/cmd.rs
+++ replace Hello::set_password with ()
@@ -207,25 +207,17 @@
             password_hash: None,
             version: crate::proto::EXPECTED_PROTOCOL_VERSION,
         }
     }
 }
 
 impl Hello {
     pub fn set_password(&mut self, hi: &super::resp::Hi, password: &str) {
-        use sha2::{Digest, Sha256};
-        let mut hasher = Sha256::default();
-        hasher.update(password.as_bytes());
-        hasher.update(hi.salt.as_ref().unwrap().as_bytes());
-        let mut hash = hasher.finalize();
-        for _ in 1..hi.iterations.unwrap_or(1) {
-            hash = Sha256::digest(&hash[..]);
-        }
-        self.password_hash = Some(format!("{:x}", hash));
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 self_to_cmd!(Hello, "HELLO");
 
 // --------------------- PUSH --------------------
 
 pub(crate) struct Push(Job);

---- hello_pwd stdout ----
thread 'hello_pwd' panicked at tests/consumer.rs:49:5:
assertion `left == right` failed
  left: None
 right: Some("6d877f8e5544b1f2598768f817413ab8a357afffa924dedae99eb91472d4ec30")

failures:
    hello_pwd

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.13s

*** result: Failure(101)
