*** src/bin/loadtest.rs:93:70: replace >= with < in main

*** mutation diff:
--- src/bin/loadtest.rs
+++ replace >= with < in main
@@ -85,17 +85,17 @@
                     job.queue = QUEUES.choose(&mut rng).unwrap().to_string();
                     p.enqueue(job).await?;
                     if pushed.fetch_add(1, atomic::Ordering::SeqCst) >= jobs {
                         return Ok::<usize, Error>(idx);
                     }
                 } else {
                     // pop
                     c.run_one(0, &random_queues[..]).await?;
-                    if popped.fetch_add(1, atomic::Ordering::SeqCst) >= jobs {
+                    if popped.fetch_add(1, atomic::Ordering::SeqCst) < /* ~ changed by cargo-mutants ~ */ jobs {
                         return Ok(idx);
                     }
                 }
             }
             Ok(jobs)
         });
     }

*** result: Success
