*** src/proto/batch/cmd.rs:8:9: replace <impl FaktoryCommand for Batch>::issue -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/batch/cmd.rs
+++ replace <impl FaktoryCommand for Batch>::issue -> Result<(), Error> with Ok(())
@@ -1,19 +1,16 @@
 use crate::error::Error;
 use crate::proto::{single::FaktoryCommand, Batch, BatchId};
 use tokio::io::AsyncWriteExt;
 
 #[async_trait::async_trait]
 impl FaktoryCommand for Batch {
     async fn issue<W: AsyncWriteExt + Unpin + Send>(&self, w: &mut W) -> Result<(), Error> {
-        w.write_all(b"BATCH NEW ").await?;
-        let r = serde_json::to_vec(self).map_err(Error::Serialization)?;
-        w.write_all(&r).await?;
-        Ok(w.write_all(b"\r\n").await?)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 macro_rules! batch_cmd {
     ($structure:ident, $cmd:expr) => {
         impl From<BatchId> for $structure {
             fn from(value: BatchId) -> Self {
                 $structure(value)

*** result: Success
