*** src/proto/batch/handle.rs:27:9: replace BatchHandle<'a, S>::add -> Result<Option<serde_json::Value>, Error> with Ok(None)

*** mutation diff:
--- src/proto/batch/handle.rs
+++ replace BatchHandle<'a, S>::add -> Result<Option<serde_json::Value>, Error> with Ok(None)
@@ -19,18 +19,17 @@
     }
 
     /// Add the given job to the batch.
     ///
     /// Should the submitted job - for whatever reason - already have a `bid` key present in its custom hash,
     /// this value will be overwritten by the ID of the batch this job is being added to with the old value
     /// returned as `Some(<old value here>)`.
     pub async fn add(&mut self, mut job: Job) -> Result<Option<serde_json::Value>, Error> {
-        let bid = job.custom.insert("bid".into(), self.bid.clone().into());
-        self.c.enqueue(job).await.map(|_| bid)
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Initiate a child batch of jobs.
     pub async fn start_batch(&mut self, mut batch: Batch) -> Result<BatchHandle<'_, S>, Error> {
         batch.parent_bid = Some(self.bid.clone());
         self.c.start_batch(batch).await
     }

*** result: Success
