*** src/proto/batch/handle.rs:44:9: replace BatchHandle<'a, S>::commit -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/batch/handle.rs
+++ replace BatchHandle<'a, S>::commit -> Result<(), Error> with Ok(())
@@ -36,11 +36,11 @@
 
     /// Commit this batch.
     ///
     /// The Faktory server will not queue any callbacks, unless the batch is committed.
     /// Committing an empty batch will make the server queue the callback(s) right away.
     /// Once committed, the batch can still be re-opened with [open_batch](Client::open_batch),
     /// and extra jobs can be added to it.
     pub async fn commit(self) -> Result<(), Error> {
-        self.c.commit_batch(self.bid).await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
