*** src/proto/batch/status.rs:31:9: replace <impl Display for CallbackState>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/proto/batch/status.rs
+++ replace <impl Display for CallbackState>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -23,23 +23,17 @@
     Enqueued,
     /// The enqueued callback job has been consumed and successfully executed.
     #[serde(rename = "2")]
     FinishedOk,
 }
 
 impl std::fmt::Display for CallbackState {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        use CallbackState::*;
-        let s = match self {
-            Pending => "Pending",
-            Enqueued => "Enqueued",
-            FinishedOk => "FinishedOk",
-        };
-        write!(f, "{}", s)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Batch status retrieved from Faktory server.
 #[derive(Deserialize, Debug)]
 pub struct BatchStatus {
     // Fields "bid", "created_at", "description", "total", "pending", and "failed"
     // are described in the docs: https://github.com/contribsys/faktory/wiki/Ent-Batches#status

*** result: Success
