*** src/proto/client/ent.rs:49:9: replace ReadToken<'a, S>::read_bid -> Result<BatchId, Error> with Ok(Default::default())

*** mutation diff:
--- src/proto/client/ent.rs
+++ replace ReadToken<'a, S>::read_bid -> Result<BatchId, Error> with Ok(Default::default())
@@ -41,17 +41,17 @@
 
     pub(crate) async fn commit_batch(&mut self, bid: BatchId) -> Result<(), Error> {
         self.issue(&CommitBatch::from(bid)).await?.read_ok().await
     }
 }
 
 impl<'a, S: AsyncBufReadExt + AsyncWriteExt + Unpin + Send> ReadToken<'a, S> {
     pub(crate) async fn read_bid(self) -> Result<BatchId, Error> {
-        single::read_bid(&mut self.0.stream).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) async fn maybe_bid(self) -> Result<Option<BatchId>, Error> {
         use crate::error;
 
         let bid_read_res = single::read_bid(&mut self.0.stream).await;
         if bid_read_res.is_ok() {
             return Ok(Some(bid_read_res.unwrap()));

*** result: Success
