*** src/proto/client/mod.rs:174:9: replace <impl Drop for Client<S>>::drop with ()

*** mutation diff:
--- src/proto/client/mod.rs
+++ replace <impl Drop for Client<S>>::drop with ()
@@ -166,23 +166,17 @@
     }
 }
 
 impl<S> Drop for Client<S>
 where
     S: AsyncBufReadExt + AsyncWriteExt + Unpin + Send,
 {
     fn drop(&mut self) {
-        tokio::task::block_in_place(|| {
-            tokio::runtime::Handle::current().block_on(async {
-                single::write_command(&mut self.stream, &single::End)
-                    .await
-                    .unwrap();
-            })
-        });
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub(crate) enum HeartbeatStatus {
     Ok,
     Terminate,
     Quiet,
 }

---- hello stdout ----
thread 'hello' panicked at tests/consumer.rs:32:5:
assertion `left == right` failed
  left: []
 right: [69, 78, 68, 13, 10]

---- terminate stdout ----
thread 'terminate' panicked at tests/consumer.rs:400:5:
assertion failed: written.ends_with(b"\r\nEND\r\n")

---- well_behaved stdout ----
thread 'well_behaved' panicked at tests/consumer.rs:202:5:
assertion `left == right` failed
  left: "BEAT {\"wid\":\"wid\"}\r\nBEAT {\"wid\":\"wid\"}\r\n"
 right: "BEAT {\"wid\":\"wid\"}\r\nBEAT {\"wid\":\"wid\"}\r\nEND\r\n"

failures:
    hello
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 3 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.15s

*** result: Failure(101)
