*** src/proto/client/mod.rs:286:9: replace Client<S>::fetch -> Result<Option<Job>, Error> with Ok(None)

*** mutation diff:
--- src/proto/client/mod.rs
+++ replace Client<S>::fetch -> Result<Option<Job>, Error> with Ok(None)
@@ -278,20 +278,17 @@
         single::write_command(&mut self.stream, c).await?;
         Ok(ReadToken(self))
     }
 
     pub(crate) async fn fetch<Q>(&mut self, queues: &[Q]) -> Result<Option<Job>, Error>
     where
         Q: AsRef<str> + Sync,
     {
-        self.issue(&single::Fetch::from(queues))
-            .await?
-            .read_json()
-            .await
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) async fn heartbeat(&mut self) -> Result<HeartbeatStatus, Error> {
         single::write_command(
             &mut self.stream,
             &single::Heartbeat::new(self.opts.wid.as_ref().unwrap().clone()),
         )
         .await?;

---- dequeue stdout ----
thread 'dequeue' panicked at tests/consumer.rs:89:5:
assertion `left == right` failed
  left: []
 right: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]

---- dequeue_first_empty stdout ----
thread 'dequeue_first_empty' panicked at tests/consumer.rs:133:25:
assertion failed: did_work

---- terminate stdout ----
thread 'terminate' panicked at tests/consumer.rs:394:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    dequeue
    dequeue_first_empty
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 2 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.14s

*** result: Failure(101)
