*** src/proto/client/mod.rs:359:24: replace - with / in Client<S>::enqueue_many

*** mutation diff:
--- src/proto/client/mod.rs
+++ replace - with / in Client<S>::enqueue_many
@@ -351,17 +351,17 @@
             .issue(&PushBulk::from(jobs.collect::<Vec<_>>()))
             .await?
             .read_json()
             .await?
             .expect("Faktory server sends {} literal when there are no errors");
         if errors.is_empty() {
             return Ok((jobs_count, None));
         }
-        Ok((jobs_count - errors.len(), Some(errors)))
+        Ok((jobs_count / /* ~ changed by cargo-mutants ~ */ errors.len(), Some(errors)))
     }
 
     /// Retrieve information about the running server.
     ///
     /// The returned value is the result of running the `INFO` command on the server.
     pub async fn info(&mut self) -> Result<serde_json::Value, Error> {
         self.issue(&Info)
             .await?

*** result: Success
