*** src/proto/client/mod.rs:366:9: replace Client<S>::info -> Result<serde_json::Value, Error> with Ok(Default::default())

*** mutation diff:
--- src/proto/client/mod.rs
+++ replace Client<S>::info -> Result<serde_json::Value, Error> with Ok(Default::default())
@@ -358,21 +358,17 @@
         }
         Ok((jobs_count - errors.len(), Some(errors)))
     }
 
     /// Retrieve information about the running server.
     ///
     /// The returned value is the result of running the `INFO` command on the server.
     pub async fn info(&mut self) -> Result<serde_json::Value, Error> {
-        self.issue(&Info)
-            .await?
-            .read_json()
-            .await
-            .map(|v| v.expect("info command cannot give empty response"))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Pause the given queues.
     pub async fn queue_pause<Q>(&mut self, queues: &[Q]) -> Result<(), Error>
     where
         Q: AsRef<str> + Sync,
     {
         self.issue(&QueueControl::new(QueueAction::Pause, queues))

*** result: Success
