*** src/proto/client/mod.rs:389:9: replace Client<S>::queue_resume -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/client/mod.rs
+++ replace Client<S>::queue_resume -> Result<(), Error> with Ok(())
@@ -381,20 +381,17 @@
             .await
     }
 
     /// Resume the given queues.
     pub async fn queue_resume<Q>(&mut self, queues: &[Q]) -> Result<(), Error>
     where
         Q: AsRef<str> + Sync,
     {
-        self.issue(&QueueControl::new(QueueAction::Resume, queues))
-            .await?
-            .read_ok()
-            .await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub struct ReadToken<'a, S>(pub(crate) &'a mut Client<S>)
 where
     S: AsyncBufReadExt + AsyncWriteExt + Unpin + Send;
 
 impl<'a, S: AsyncBufReadExt + AsyncWriteExt + Unpin + Send> ReadToken<'a, S> {

---- queue_control stdout ----
thread 'queue_control' panicked at tests/producer.rs:100:5:
assertion failed: written == b"QUEUE PAUSE test test2\r\nQUEUE RESUME test3 test4\r\n"

failures:
    queue_control

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
