*** src/proto/single/cmd.rs:113:9: replace Fail::set_backtrace with ()

*** mutation diff:
--- src/proto/single/cmd.rs
+++ replace Fail::set_backtrace with ()
@@ -105,17 +105,17 @@
     // Used for all kind of errors not related to domain logic, e.g. missing handler for this type of job (i.e.
     // the worker consumed a job from a specified queue, but has no tool to process it).
     // Note that "unknown" is the error type used by the Go library in such cases too.
     pub(crate) fn generic<S: Into<String>>(job_id: JobId, message: S) -> Self {
         Fail::new(job_id, "unknown", message)
     }
 
     pub(crate) fn set_backtrace(&mut self, lines: Vec<String>) {
-        self.backtrace = lines;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     // For any application errors (all kind of errors that could happen in userland when handling the job)
     // we want to send backtrace (split into lines) to the Faktory server so that whoever is interested in
     // the job result could follow the trace (for debugging essentially).
     pub(crate) fn generic_with_backtrace<E>(jid: JobId, e: E) -> Self
     where
         E: StdError,

*** result: Success
