*** src/proto/single/cmd.rs:144:9: replace <impl FaktoryCommand for End>::issue -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/single/cmd.rs
+++ replace <impl FaktoryCommand for End>::issue -> Result<(), Error> with Ok(())
@@ -136,17 +136,17 @@
 
 // ---------------------- END --------------------
 
 pub(crate) struct End;
 
 #[async_trait::async_trait]
 impl FaktoryCommand for End {
     async fn issue<W: AsyncWriteExt + Unpin + Send>(&self, w: &mut W) -> Result<(), Error> {
-        Ok(w.write_all(b"END\r\n").await?)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // --------------------- FETCH --------------------
 
 pub(crate) struct Fetch<'a, S>
 where
     S: AsRef<str>,

---- hello stdout ----
thread 'hello' panicked at tests/consumer.rs:32:5:
assertion `left == right` failed
  left: []
 right: [69, 78, 68, 13, 10]

---- terminate stdout ----
thread 'terminate' panicked at tests/consumer.rs:400:5:
assertion failed: written.ends_with(b"\r\nEND\r\n")

---- well_behaved_many stdout ----
thread 'well_behaved_many' panicked at tests/consumer.rs:342:5:
assertion `left == right` failed
  left: "BEAT {\"wid\":\"wid\"}\r\nBEAT {\"wid\":\"wid\"}\r\n"
 right: "BEAT {\"wid\":\"wid\"}\r\nBEAT {\"wid\":\"wid\"}\r\nEND\r\n"

failures:
    hello
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 3 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.13s

*** result: Failure(101)
