*** src/proto/single/cmd.rs:163:9: replace <impl FaktoryCommand for Fetch<'a, Q>>::issue -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/single/cmd.rs
+++ replace <impl FaktoryCommand for Fetch<'a, Q>>::issue -> Result<(), Error> with Ok(())
@@ -155,19 +155,17 @@
 }
 
 #[async_trait::async_trait]
 impl<'a, Q> FaktoryCommand for Fetch<'a, Q>
 where
     Q: AsRef<str> + Sync,
 {
     async fn issue<W: AsyncWriteExt + Unpin + Send>(&self, w: &mut W) -> Result<(), Error> {
-        w.write_all(b"FETCH").await?;
-        write_queues(w, self.queues).await?;
-        Ok(w.write_all(b"\r\n").await?)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<'a, S> From<&'a [S]> for Fetch<'a, S>
 where
     S: AsRef<str> + 'a,
 {
     fn from(queues: &'a [S]) -> Self {

---- dequeue_first_empty stdout ----
thread 'dequeue_first_empty' panicked at tests/consumer.rs:141:5:
assertion `left == right` failed
  left: [65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]
 right: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]

---- dequeue stdout ----
thread 'dequeue' panicked at tests/consumer.rs:89:5:
assertion `left == right` failed
  left: [65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]
 right: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]

---- terminate stdout ----
{"jid":"forever","errtype":"unknown","message":"terminated"}
thread 'terminate' panicked at tests/consumer.rs:420:5:
assertion `left == right` failed
  left: "[\"rust\"],\"v\":2}\r\n"
 right: "\r\nFETCH default\r\n"

failures:
    dequeue
    dequeue_first_empty
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 2 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.13s

*** result: Failure(101)
