*** src/proto/single/cmd.rs:298:9: replace <impl FaktoryCommand for QueueControl<'_, Q>>::issue -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/single/cmd.rs
+++ replace <impl FaktoryCommand for QueueControl<'_, Q>>::issue -> Result<(), Error> with Ok(())
@@ -290,22 +290,16 @@
 }
 
 #[async_trait::async_trait]
 impl<Q> FaktoryCommand for QueueControl<'_, Q>
 where
     Q: AsRef<str> + Sync,
 {
     async fn issue<W: AsyncWriteExt + Unpin + Send>(&self, w: &mut W) -> Result<(), Error> {
-        let command = match self.action {
-            QueueAction::Pause => b"QUEUE PAUSE".as_ref(),
-            QueueAction::Resume => b"QUEUE RESUME".as_ref(),
-        };
-        w.write_all(command).await?;
-        write_queues(w, self.queues).await?;
-        Ok(w.write_all(b"\r\n").await?)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 impl<'a, S: AsRef<str>> QueueControl<'a, S> {
     pub fn new(action: QueueAction, queues: &'a [S]) -> Self {
         Self { action, queues }
     }
 }

---- queue_control stdout ----
thread 'queue_control' panicked at tests/producer.rs:100:5:
assertion failed: written == b"QUEUE PAUSE test test2\r\nQUEUE RESUME test3 test4\r\n"

failures:
    queue_control

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
