*** src/proto/single/cmd.rs:33:5: replace write_queues -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/single/cmd.rs
+++ replace write_queues -> Result<(), Error> with Ok(())
@@ -25,22 +25,17 @@
 
 /// Write queues as part of a command. They are written with a leading space
 /// followed by space separated queue names.
 async fn write_queues<W, S>(w: &mut W, queues: &[S]) -> Result<(), Error>
 where
     W: AsyncWriteExt + Unpin + Send,
     S: AsRef<str>,
 {
-    for q in queues {
-        w.write_all(b" ").await?;
-        w.write_all(q.as_ref().as_bytes()).await?;
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 // -------------------- INFO ----------------------
 
 pub(crate) struct Info;
 
 #[async_trait::async_trait]
 impl FaktoryCommand for Info {

---- dequeue stdout ----
thread 'dequeue' panicked at tests/consumer.rs:89:5:
assertion `left == right` failed
  left: [70, 69, 84, 67, 72, 13, 10, 65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]
 right: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]

---- dequeue_first_empty stdout ----
thread 'dequeue_first_empty' panicked at tests/consumer.rs:141:5:
assertion `left == right` failed
  left: [70, 69, 84, 67, 72, 13, 10, 70, 69, 84, 67, 72, 13, 10, 65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]
 right: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]

---- terminate stdout ----
{"jid":"forever","errtype":"unknown","message":"terminated"}
thread 'terminate' panicked at tests/consumer.rs:420:5:
assertion `left == right` failed
  left: "],\"v\":2}\r\nFETCH\r\n"
 right: "\r\nFETCH default\r\n"

failures:
    dequeue
    dequeue_first_empty
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 2 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.14s

*** result: Failure(101)
