*** src/proto/single/ent/mod.rs:46:36: replace + with - in JobBuilder::expires_in

*** mutation diff:
--- src/proto/single/ent/mod.rs
+++ replace + with - in JobBuilder::expires_in
@@ -38,17 +38,17 @@
     /// # use faktory::JobBuilder;
     /// # use chrono::Duration;
     /// let _job = JobBuilder::new("order")
     ///     .args(vec!["ISBN-14:9781718501850"])
     ///     .expires_in(Duration::weeks(0))
     ///     .build();
     /// ```
     pub fn expires_in(&mut self, ttl: chrono::Duration) -> &mut Self {
-        self.expires_at(Utc::now() + ttl)
+        self.expires_at(Utc::now() - /* ~ changed by cargo-mutants ~ */ ttl)
     }
 
     /// How long the Faktory will not accept duplicates of this job.
     ///
     /// The job will be considered unique for the kind-args-queue combination. The uniqueness is best-effort,
     /// rather than a guarantee. Check out the Enterprise Faktory [docs](https://github.com/contribsys/faktory/wiki/Ent-Unique-Jobs)
     /// for details on how scheduling, retries, and other features live together with `unique_for`.
     ///

*** result: Success
