*** src/proto/single/ent/progress.rs:102:9: replace <impl Display for JobState>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/proto/single/ent/progress.rs
+++ replace <impl Display for JobState>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -94,26 +94,17 @@
     Failed,
 
     /// The jobs has been consumed but its status has never been updated.
     Dead,
 }
 
 impl std::fmt::Display for JobState {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        use JobState::*;
-        let s = match self {
-            Unknown => "unknown",
-            Enqueued => "enqueued",
-            Working => "working",
-            Success => "success",
-            Failed => "failed",
-            Dead => "dead",
-        };
-        write!(f, "{}", s)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Info on job execution progress (retrieved).
 ///
 /// The tracker is guaranteed to get the following details: the job's id (though they should
 /// know it beforehand in order to be ably to track the job), its last known [`state`](JobState), and
 /// the date and time the job was last updated. Additionally, arbitrary information on what's going

*** result: Success
