*** src/proto/single/mod.rs:250:9: replace Job::kind -> &str with "xyzzy"

*** mutation diff:
--- src/proto/single/mod.rs
+++ replace Job::kind -> &str with "xyzzy"
@@ -242,17 +242,17 @@
 
     /// This job's id.
     pub fn id(&self) -> &JobId {
         &self.jid
     }
 
     /// This job's type.
     pub fn kind(&self) -> &str {
-        &self.kind
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     /// The arguments provided for this job.
     pub fn args(&self) -> &[serde_json::Value] {
         &self.args
     }
 
     /// Data about this job's most recent failure.

---- dequeue_first_empty stdout ----
thread 'dequeue_first_empty' panicked at tests/consumer.rs:141:5:
assertion `left == right` failed
 right: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]

---- dequeue stdout ----
thread 'dequeue' panicked at tests/consumer.rs:89:5:
assertion `left == right` failed
 right: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]

---- terminate stdout ----
thread 'terminate' panicked at tests/consumer.rs:394:34:
called `Result::unwrap()` on an `Err` value: IO(Custom { kind: UnexpectedEof, error: "early eof" })

failures:
    dequeue
    dequeue_first_empty
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 2 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
