*** src/proto/single/mod.rs:255:9: replace Job::args -> &[serde_json::Value] with Vec::leak(Vec::new())

*** mutation diff:
--- src/proto/single/mod.rs
+++ replace Job::args -> &[serde_json::Value] with Vec::leak(Vec::new())
@@ -247,17 +247,17 @@
 
     /// This job's type.
     pub fn kind(&self) -> &str {
         &self.kind
     }
 
     /// The arguments provided for this job.
     pub fn args(&self) -> &[serde_json::Value] {
-        &self.args
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Data about this job's most recent failure.
     pub fn failure(&self) -> &Option<Failure> {
         &self.failure
     }
 }
 pub async fn write_command<W: AsyncWriteExt + Unpin + Send, C: FaktoryCommand>(

---- dequeue stdout ----
thread 'dequeue' panicked at tests/consumer.rs:62:9:
assertion `left == right` failed
  left: []
 right: ["z"]

---- dequeue_first_empty stdout ----
thread 'dequeue_first_empty' panicked at tests/consumer.rs:101:9:
assertion `left == right` failed
  left: []
 right: ["z"]

failures:
    dequeue
    dequeue_first_empty

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.15s

*** result: Failure(101)
