*** src/proto/single/resp.rs:110:5: replace read_ok -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/single/resp.rs
+++ replace read_ok -> Result<(), Error> with Ok(())
@@ -102,24 +102,17 @@
         }
     }
     Err(bad("server hi", &rr).into())
 }
 
 // ----------------------------------------------
 
 pub async fn read_ok<R: AsyncBufReadExt + Unpin>(r: R) -> Result<(), Error> {
-    let rr = read(r).await?;
-    if let RawResponse::String(ref s) = rr {
-        if s == "OK" {
-            return Ok(());
-        }
-    }
-
-    Err(bad("server ok", &rr).into())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 // ----------------------------------------------
 //
 // below is the implementation of the Redis RESP protocol
 //
 // ----------------------------------------------

---- dequeue stdout ----
thread 'dequeue' panicked at tests/consumer.rs:89:5:
assertion `left == right` failed
  left: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10]
 right: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]

---- dequeue_first_empty stdout ----
thread 'dequeue_first_empty' panicked at tests/consumer.rs:133:25:
assertion failed: did_work

---- no_first_job stdout ----
thread 'no_first_job' panicked at tests/consumer.rs:259:34:
called `Result::unwrap()` on an `Err` value: IO(Custom { kind: UnexpectedEof, error: "early eof" })

failures:
    dequeue
    dequeue_first_empty
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 2 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.15s

*** result: Failure(101)
