*** src/proto/single/resp.rs:112:14: replace == with != in read_ok

*** mutation diff:
--- src/proto/single/resp.rs
+++ replace == with != in read_ok
@@ -104,17 +104,17 @@
     Err(bad("server hi", &rr).into())
 }
 
 // ----------------------------------------------
 
 pub async fn read_ok<R: AsyncBufReadExt + Unpin>(r: R) -> Result<(), Error> {
     let rr = read(r).await?;
     if let RawResponse::String(ref s) = rr {
-        if s == "OK" {
+        if s != /* ~ changed by cargo-mutants ~ */ "OK" {
             return Ok(());
         }
     }
 
     Err(bad("server ok", &rr).into())
 }
 
 // ----------------------------------------------

*** result: Failure(101)
