*** src/proto/single/resp.rs:160:29: replace - with / in read

*** mutation diff:
--- src/proto/single/resp.rs
+++ replace - with / in read
@@ -152,17 +152,17 @@
         }
         b'-' => {
             // Error
             // https://redis.io/topics/protocol#resp-errors
             let mut s = String::new();
             r.read_line(&mut s).await?;
 
             // remove newlines
-            let l = s.len() - 2;
+            let l = s.len() / /* ~ changed by cargo-mutants ~ */ 2;
             s.truncate(l);
 
             Err(error::Protocol::new(s).into())
         }
         b':' => {
             // Integer
             // https://redis.io/topics/protocol#resp-integers
             let mut s = String::with_capacity(32);

---- proto::single::resp::test::it_parses_errors stdout ----
thread 'proto::single::resp::test::it_parses_errors' panicked at src/proto/single/resp.rs:298:13:
assertion `left == right` failed
  left: ""
 right: "foo"

failures:
    proto::single::resp::test::it_parses_errors

test result: FAILED. 34 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.13s

*** result: Failure(101)
