*** src/proto/single/resp.rs:190:63: replace - with + in read

*** mutation diff:
--- src/proto/single/resp.rs
+++ replace - with + in read
@@ -182,17 +182,17 @@
                 .into()),
             }
         }
         b'$' => {
             // Bulk String
             // https://redis.io/topics/protocol#resp-bulk-strings
             let mut bytes = Vec::with_capacity(32);
             r.read_until(b'\n', &mut bytes).await?;
-            let s = std::str::from_utf8(&bytes[0..bytes.len() - 2]).map_err(|_| {
+            let s = std::str::from_utf8(&bytes[0..bytes.len() + /* ~ changed by cargo-mutants ~ */ 2]).map_err(|_| {
                 error::Protocol::BadResponse {
                     typed_as: "bulk string",
                     error: "server bulk response contains non-utf8 size prefix",
                     bytes: bytes[0..bytes.len() - 2].to_vec(),
                 }
             })?;
 
             let size = s

---- proto::single::resp::test::it_decodes_json_empty stdout ----
thread 'proto::single::resp::test::it_decodes_json_empty' panicked at src/proto/single/resp.rs:190:47:
range end index 5 out of range for slice of length 3

---- proto::single::resp::test::it_decodes_json_ok_blob stdout ----
thread 'proto::single::resp::test::it_decodes_json_ok_blob' panicked at src/proto/single/resp.rs:190:47:
range end index 5 out of range for slice of length 3

---- proto::single::resp::test::it_errors_on_bad_json_blob stdout ----
thread 'proto::single::resp::test::it_errors_on_bad_json_blob' panicked at src/proto/single/resp.rs:190:47:
range end index 5 out of range for slice of length 3

failures:
    proto::single::resp::test::it_decodes_blob_json
    proto::single::resp::test::it_decodes_json_empty
    proto::single::resp::test::it_decodes_json_nill
    proto::single::resp::test::it_decodes_json_ok_blob
    proto::single::resp::test::it_errors_on_bad_json_blob
    proto::single::resp::test::it_errors_on_bad_sizes
    proto::single::resp::test::it_parses_empty_bulk
    proto::single::resp::test::it_parses_nills
    proto::single::resp::test::it_parses_non_empty_bulk

test result: FAILED. 26 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.22s

*** result: Failure(101)
