*** src/proto/single/resp.rs:194:49: replace - with / in read

*** mutation diff:
--- src/proto/single/resp.rs
+++ replace - with / in read
@@ -186,17 +186,17 @@
             // Bulk String
             // https://redis.io/topics/protocol#resp-bulk-strings
             let mut bytes = Vec::with_capacity(32);
             r.read_until(b'\n', &mut bytes).await?;
             let s = std::str::from_utf8(&bytes[0..bytes.len() - 2]).map_err(|_| {
                 error::Protocol::BadResponse {
                     typed_as: "bulk string",
                     error: "server bulk response contains non-utf8 size prefix",
-                    bytes: bytes[0..bytes.len() - 2].to_vec(),
+                    bytes: bytes[0..bytes.len() / /* ~ changed by cargo-mutants ~ */ 2].to_vec(),
                 }
             })?;
 
             let size = s
                 .parse::<isize>()
                 .map_err(|_| error::Protocol::BadResponse {
                     typed_as: "bulk string",
                     error: "server bulk response size prefix is not an integer",

*** result: Success
