*** src/proto/single/resp.rs:206:21: replace == with != in read

*** mutation diff:
--- src/proto/single/resp.rs
+++ replace == with != in read
@@ -198,17 +198,17 @@
             let size = s
                 .parse::<isize>()
                 .map_err(|_| error::Protocol::BadResponse {
                     typed_as: "bulk string",
                     error: "server bulk response size prefix is not an integer",
                     bytes: s.as_bytes().to_vec(),
                 })?;
 
-            if size == -1 {
+            if size != /* ~ changed by cargo-mutants ~ */ -1 {
                 Ok(RawResponse::Null)
             } else {
                 let size = size as usize;
                 let mut bytes = vec![0; size];
                 r.read_exact(&mut bytes[..]).await?;
                 r.read_exact(&mut [0u8; 2]).await?;
                 Ok(RawResponse::Blob(bytes))
             }

---- proto::single::resp::test::it_errors_on_bad_json_blob stdout ----
thread 'proto::single::resp::test::it_errors_on_bad_json_blob' panicked at src/proto/single/resp.rs:389:63:
called `Result::unwrap_err()` on an `Ok` value: None

---- proto::single::resp::test::it_decodes_json_nill stdout ----
thread 'proto::single::resp::test::it_decodes_json_nill' panicked at library/alloc/src/raw_vec.rs:570:5:
capacity overflow

---- proto::single::resp::test::it_decodes_blob_json stdout ----
thread 'proto::single::resp::test::it_decodes_blob_json' panicked at src/proto/single/resp.rs:383:9:
assertion `left == right` failed
  left: None
 right: Some(Object {"hello": Number(1)})

failures:
    proto::single::resp::test::it_decodes_blob_json
    proto::single::resp::test::it_decodes_json_nill
    proto::single::resp::test::it_errors_on_bad_json_blob
    proto::single::resp::test::it_parses_empty_bulk
    proto::single::resp::test::it_parses_nills
    proto::single::resp::test::it_parses_non_empty_bulk

test result: FAILED. 29 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.36s

*** result: Failure(101)
