*** src/proto/single/resp.rs:47:39: replace == with != in read_json

*** mutation diff:
--- src/proto/single/resp.rs
+++ replace == with != in read_json
@@ -39,17 +39,17 @@
         RawResponse::String(ref s) if s == "OK" => {
             return Ok(None);
         }
         RawResponse::String(ref s) => {
             return serde_json::from_str(s)
                 .map(Some)
                 .map_err(Error::Serialization);
         }
-        RawResponse::Blob(ref b) if b == b"OK" => {
+        RawResponse::Blob(ref b) if b != /* ~ changed by cargo-mutants ~ */ b"OK" => {
             return Ok(None);
         }
         RawResponse::Blob(ref b) => {
             if b.is_empty() {
                 return Ok(None);
             }
             return serde_json::from_slice(b)
                 .map(Some)

---- proto::single::resp::test::it_decodes_blob_json stdout ----
thread 'proto::single::resp::test::it_decodes_blob_json' panicked at src/proto/single/resp.rs:383:9:
assertion `left == right` failed
  left: None
 right: Some(Object {"hello": Number(1)})

---- proto::single::resp::test::it_decodes_json_ok_blob stdout ----
thread 'proto::single::resp::test::it_decodes_json_ok_blob' panicked at src/proto/single/resp.rs:355:39:
called `Result::unwrap()` on an `Err` value: Serialization(Error("expected value", line: 1, column: 1))

---- proto::single::resp::test::it_errors_on_bad_json_blob stdout ----
thread 'proto::single::resp::test::it_errors_on_bad_json_blob' panicked at src/proto/single/resp.rs:389:63:
called `Result::unwrap_err()` on an `Ok` value: None

failures:
    proto::single::resp::test::it_decodes_blob_json
    proto::single::resp::test::it_decodes_json_ok_blob
    proto::single::resp::test::it_errors_on_bad_json_blob

test result: FAILED. 32 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.10s

*** result: Failure(101)
