*** src/proto/single/utils.rs:15:5: replace gen_random_jid -> String with "xyzzy".into()

*** mutation diff:
--- src/proto/single/utils.rs
+++ replace gen_random_jid -> String with "xyzzy".into()
@@ -7,17 +7,17 @@
     thread_rng()
         .sample_iter(&rand::distributions::Alphanumeric)
         .map(char::from)
         .take(length)
         .collect()
 }
 
 pub(crate) fn gen_random_jid() -> String {
-    gen_random_id(JOB_ID_LENGTH)
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn gen_random_wid() -> String {
     gen_random_id(WORKER_ID_LENGTH)
 }
 
 #[cfg(test)]
 mod test {

---- proto::single::test::test_all_job_creation_variants_align stdout ----
thread 'proto::single::test::test_all_job_creation_variants_align' panicked at src/proto/single/mod.rs:337:9:
assertion `left != right` failed
  left: JobId("xyzzy")
 right: JobId("xyzzy")

failures:
    proto::single::test::test_all_job_creation_variants_align

test result: FAILED. 34 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.25s

*** result: Failure(101)
