*** src/proto/single/utils.rs:7:5: replace gen_random_id -> String with String::new()

*** mutation diff:
--- src/proto/single/utils.rs
+++ replace gen_random_id -> String with String::new()
@@ -1,19 +1,15 @@
 use rand::{thread_rng, Rng};
 
 const JOB_ID_LENGTH: usize = 16;
 const WORKER_ID_LENGTH: usize = 32;
 
 fn gen_random_id(length: usize) -> String {
-    thread_rng()
-        .sample_iter(&rand::distributions::Alphanumeric)
-        .map(char::from)
-        .take(length)
-        .collect()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn gen_random_jid() -> String {
     gen_random_id(JOB_ID_LENGTH)
 }
 
 pub(crate) fn gen_random_wid() -> String {
     gen_random_id(WORKER_ID_LENGTH)

---- proto::single::test::test_all_job_creation_variants_align stdout ----
thread 'proto::single::test::test_all_job_creation_variants_align' panicked at src/proto/single/mod.rs:337:9:
assertion `left != right` failed
  left: JobId("")
 right: JobId("")

---- proto::single::test::test_job_can_be_created_with_builder stdout ----
thread 'proto::single::test::test_job_can_be_created_with_builder' panicked at src/proto/single/mod.rs:292:9:
assertion failed: job.jid != "".into()

---- proto::single::utils::test::test_id_of_known_size_generated stdout ----
thread 'proto::single::utils::test::test_id_of_known_size_generated' panicked at src/proto/single/utils.rs:27:9:
assertion `left != right` failed
  left: ""
 right: ""

failures:
    proto::single::test::test_all_job_creation_variants_align
    proto::single::test::test_job_can_be_created_with_builder
    proto::single::utils::test::test_id_of_known_size_generated
    proto::single::utils::test::test_ids_are_unique

test result: FAILED. 31 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
