*** src/proto/utils.rs:16:21: replace != with == in url_parse

*** mutation diff:
--- src/proto/utils.rs
+++ replace != with == in url_parse
@@ -8,17 +8,17 @@
 }
 
 pub(crate) fn host_from_url(url: &Url) -> String {
     format!("{}:{}", url.host_str().unwrap(), url.port().unwrap_or(7419))
 }
 
 pub(crate) fn url_parse(url: &str) -> Result<Url, Error> {
     let url = Url::parse(url).map_err(error::Connect::ParseUrl)?;
-    if url.scheme() != "tcp" {
+    if url.scheme() == /* ~ changed by cargo-mutants ~ */ "tcp" {
         return Err(error::Connect::BadScheme {
             scheme: url.scheme().to_string(),
         }
         .into());
     }
 
     if url.host_str().is_none() || url.host_str().unwrap().is_empty() {
         return Err(error::Connect::MissingHostname.into());

---- proto::utils::tests::url_doesnt_require_port stdout ----
thread 'proto::utils::tests::url_doesnt_require_port' panicked at src/proto/utils.rs:76:40:
called `Result::unwrap()` on an `Err` value: Connect(BadScheme { scheme: "tcp" })

---- proto::utils::tests::url_can_take_password_and_port stdout ----
thread 'proto::utils::tests::url_can_take_password_and_port' panicked at src/proto/utils.rs:81:53:
called `Result::unwrap()` on an `Err` value: Connect(BadScheme { scheme: "tcp" })

failures:
    proto::utils::tests::url_can_take_password_and_port
    proto::utils::tests::url_doesnt_require_port

test result: FAILED. 33 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.25s

*** result: Failure(101)
