*** src/worker/health.rs:29:17: replace && with || in Worker<S, E>::listen_for_heartbeats

*** mutation diff:
--- src/worker/health.rs
+++ replace && with || in Worker<S, E>::listen_for_heartbeats
@@ -21,17 +21,17 @@
 
         let mut last = time::Instant::now();
 
         loop {
             tokio_sleep(time::Duration::from_millis(100)).await;
 
             // has a worker failed?
             if target == STATUS_RUNNING
-                && statuses
+                || /* ~ changed by cargo-mutants ~ */ statuses
                     .iter()
                     .any(|s| s.load(atomic::Ordering::SeqCst) == STATUS_TERMINATING)
             {
                 // tell all workers to exit
                 // (though chances are they've all failed already)
                 for s in statuses {
                     s.store(STATUS_TERMINATING, atomic::Ordering::SeqCst);
                 }

*** result: Timeout
