*** src/worker/health.rs:41:41: replace < with == in Worker<S, E>::listen_for_heartbeats

*** mutation diff:
--- src/worker/health.rs
+++ replace < with == in Worker<S, E>::listen_for_heartbeats
@@ -33,17 +33,17 @@
                 // tell all workers to exit
                 // (though chances are they've all failed already)
                 for s in statuses {
                     s.store(STATUS_TERMINATING, atomic::Ordering::SeqCst);
                 }
                 break Ok(false);
             }
 
-            if last.elapsed().as_secs() < 5 {
+            if last.elapsed().as_secs() == /* ~ changed by cargo-mutants ~ */ 5 {
                 // don't sent a heartbeat yet
                 continue;
             }
 
             match self.c.heartbeat().await {
                 Ok(hb) => {
                     match hb {
                         HeartbeatStatus::Ok => {}

---- well_behaved_many stdout ----
thread 'well_behaved_many' panicked at tests/consumer.rs:334:5:
assertion `left == right` failed
  left: 2
 right: 0

---- well_behaved stdout ----
thread 'well_behaved' panicked at tests/consumer.rs:194:5:
assertion `left == right` failed
  left: 1
 right: 0

---- no_first_job stdout ----
thread 'no_first_job' panicked at tests/consumer.rs:259:5:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    no_first_job
    well_behaved
    well_behaved_many

test result: FAILED. 5 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
