*** src/worker/mod.rs:170:9: replace Worker<S, E>::run_job -> Result<(), Failed<E>> with Ok(())

*** mutation diff:
--- src/worker/mod.rs
+++ replace Worker<S, E>::run_job -> Result<(), Failed<E>> with Ok(())
@@ -162,21 +162,17 @@
 
 enum Failed<E: StdError> {
     Application(E),
     BadJobType(String),
 }
 
 impl<S: AsyncBufReadExt + AsyncWriteExt + Send + Unpin, E: StdError + 'static + Send> Worker<S, E> {
     async fn run_job(&mut self, job: Job) -> Result<(), Failed<E>> {
-        let handler = self
-            .callbacks
-            .get(job.kind())
-            .ok_or(Failed::BadJobType(job.kind().to_string()))?;
-        handler.run(job).await.map_err(Failed::Application)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn report_failure_to_server(&mut self, f: &Fail) -> Result<(), Error> {
         self.c.issue(f).await?.read_ok().await
     }
 
     async fn report_success_to_server(&mut self, jid: JobId) -> Result<(), Error> {
         self.c.issue(&Ack::new(jid)).await?.read_ok().await

---- no_first_job stdout ----
thread 'no_first_job' panicked at tests/consumer.rs:259:34:
called `Result::unwrap()` on an `Err` value: IO(Custom { kind: UnexpectedEof, error: "early eof" })

---- terminate stdout ----
thread 'terminate' panicked at tests/consumer.rs:394:34:
called `Result::unwrap()` on an `Err` value: IO(Custom { kind: UnexpectedEof, error: "early eof" })

---- well_behaved_many stdout ----
thread 'well_behaved_many' panicked at tests/consumer.rs:334:34:
called `Result::unwrap()` on an `Err` value: IO(Custom { kind: UnexpectedEof, error: "early eof" })

failures:
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
