*** src/worker/mod.rs:178:9: replace Worker<S, E>::report_failure_to_server -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/worker/mod.rs
+++ replace Worker<S, E>::report_failure_to_server -> Result<(), Error> with Ok(())
@@ -170,17 +170,17 @@
         let handler = self
             .callbacks
             .get(job.kind())
             .ok_or(Failed::BadJobType(job.kind().to_string()))?;
         handler.run(job).await.map_err(Failed::Application)
     }
 
     async fn report_failure_to_server(&mut self, f: &Fail) -> Result<(), Error> {
-        self.c.issue(f).await?.read_ok().await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn report_success_to_server(&mut self, jid: JobId) -> Result<(), Error> {
         self.c.issue(&Ack::new(jid)).await?.read_ok().await
     }
 
     async fn report_on_all_workers(&mut self) -> Result<(), Error> {
         let worker_states = Arc::get_mut(&mut self.worker_states)

*** result: Success
