*** src/worker/mod.rs:228:9: replace Worker<S, E>::force_fail_all_workers -> usize with 0

*** mutation diff:
--- src/worker/mod.rs
+++ replace Worker<S, E>::force_fail_all_workers -> usize with 0
@@ -220,30 +220,17 @@
         Ok(())
     }
 
     // FAIL currently running jobs even though they're still running.
     // Returns the number of workers that may still be processing jobs.
     // We are ignoring any FAIL command issue errors, since this is already
     // an "emergency" case.
     async fn force_fail_all_workers(&mut self) -> usize {
-        let mut running = 0;
-        for wstate in self.worker_states.iter() {
-            let may_be_jid = wstate.lock().unwrap().take_cuurently_running();
-            if let Some(jid) = may_be_jid {
-                running += 1;
-                let f = Fail::new(jid, "unknown", "terminated");
-                let _ = match self.c.issue(&f).await {
-                    Ok(r) => r.read_ok().await,
-                    Err(_) => continue,
-                }
-                .is_ok();
-            }
-        }
-        running
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Fetch and run a single job, and then return.
     pub async fn run_one<Q>(&mut self, worker: usize, queues: &[Q]) -> Result<bool, Error>
     where
         Q: AsRef<str> + Sync,
     {
         let job = match self.c.fetch(queues).await? {

*** result: Timeout
