*** src/worker/mod.rs:228:9: replace Worker<S, E>::force_fail_all_workers -> usize with 1

*** mutation diff:
--- src/worker/mod.rs
+++ replace Worker<S, E>::force_fail_all_workers -> usize with 1
@@ -220,30 +220,17 @@
         Ok(())
     }
 
     // FAIL currently running jobs even though they're still running.
     // Returns the number of workers that may still be processing jobs.
     // We are ignoring any FAIL command issue errors, since this is already
     // an "emergency" case.
     async fn force_fail_all_workers(&mut self) -> usize {
-        let mut running = 0;
-        for wstate in self.worker_states.iter() {
-            let may_be_jid = wstate.lock().unwrap().take_cuurently_running();
-            if let Some(jid) = may_be_jid {
-                running += 1;
-                let f = Fail::new(jid, "unknown", "terminated");
-                let _ = match self.c.issue(&f).await {
-                    Ok(r) => r.read_ok().await,
-                    Err(_) => continue,
-                }
-                .is_ok();
-            }
-        }
-        running
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Fetch and run a single job, and then return.
     pub async fn run_one<Q>(&mut self, worker: usize, queues: &[Q]) -> Result<bool, Error>
     where
         Q: AsRef<str> + Sync,
     {
         let job = match self.c.fetch(queues).await? {

---- terminate stdout ----
thread 'terminate' panicked at tests/consumer.rs:399:5:
assertion `left == right` failed
  left: [66, 69, 65, 84, 32, 123, 34, 119, 105, 100, 34, 58, 34, 119, 105, 100, 34, 125, 13, 10, 69, 78, 68, 13, 10]
 right: [66, 69, 65, 84, 32, 123, 34, 119, 105, 100, 34, 58, 34, 119, 105, 100, 34, 125, 13, 10, 70, 65, 73, 76, 32]

---- well_behaved stdout ----
thread 'well_behaved' panicked at tests/consumer.rs:194:5:
assertion `left == right` failed
  left: 1
 right: 0

---- no_first_job stdout ----
thread 'no_first_job' panicked at tests/consumer.rs:259:5:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.14s

*** result: Failure(101)
