*** src/worker/mod.rs:232:25: replace += with -= in Worker<S, E>::force_fail_all_workers

*** mutation diff:
--- src/worker/mod.rs
+++ replace += with -= in Worker<S, E>::force_fail_all_workers
@@ -224,17 +224,17 @@
     // Returns the number of workers that may still be processing jobs.
     // We are ignoring any FAIL command issue errors, since this is already
     // an "emergency" case.
     async fn force_fail_all_workers(&mut self) -> usize {
         let mut running = 0;
         for wstate in self.worker_states.iter() {
             let may_be_jid = wstate.lock().unwrap().take_cuurently_running();
             if let Some(jid) = may_be_jid {
-                running += 1;
+                running -= /* ~ changed by cargo-mutants ~ */ 1;
                 let f = Fail::new(jid, "unknown", "terminated");
                 let _ = match self.c.issue(&f).await {
                     Ok(r) => r.read_ok().await,
                     Err(_) => continue,
                 }
                 .is_ok();
             }
         }

---- terminate stdout ----
thread 'tokio-runtime-worker' panicked at /tmp/cargo-mutants-faktory-rs-jIMFg4.tmp/src/worker/mod.rs:232:17:
attempt to subtract with overflow
thread 'terminate' panicked at tests/consumer.rs:394:25:
called `Result::unwrap()` on an `Err` value: JoinError::Panic(Id(249), ...)

failures:
    terminate

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.13s

*** result: Failure(101)
