*** src/worker/mod.rs:358:24: replace != with == in Worker<S, E>::run

*** mutation diff:
--- src/worker/mod.rs
+++ replace != with == in Worker<S, E>::run
@@ -350,17 +350,17 @@
         //  - we got TERMINATE, so we should just return, even if a worker is still running
         //  - we got TERMINATE and all workers has exited
         //  - we got an error from heartbeat()
         //
         self.terminated = exit.is_ok();
 
         if let Ok(true) = exit {
             let running = self.force_fail_all_workers().await;
-            if running != 0 {
+            if running == /* ~ changed by cargo-mutants ~ */ 0 {
                 return Ok(running);
             }
         }
 
         // we want to expose worker errors, or otherwise the heartbeat error
         let mut results = Vec::with_capacity(workers_count);
         for w in workers {
             results.push(w.await.expect("joined ok"));

*** result: Timeout
