*** src/worker/runner.rs:76:9: replace <impl JobRunner for &'a F>::run -> Result<(), E> with Ok(())

*** mutation diff:
--- src/worker/runner.rs
+++ replace <impl JobRunner for &'a F>::run -> Result<(), E> with Ok(())
@@ -68,17 +68,17 @@
 #[async_trait::async_trait]
 impl<'a, E, F, Fut> JobRunner for &'a F
 where
     F: Send + Sync + Fn(Job) -> Fut,
     Fut: Future<Output = Result<(), E>> + Send,
 {
     type Error = E;
     async fn run(&self, job: Job) -> Result<(), E> {
-        self(job).await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[repr(transparent)]
 pub(crate) struct Closure<F>(pub F);
 
 #[async_trait::async_trait]
 impl<E, F, Fut> JobRunner for Closure<F>

*** result: Success
