*** src/worker/runner.rs:91:9: replace <impl JobRunner for Closure<F>>::run -> Result<(), E> with Ok(())

*** mutation diff:
--- src/worker/runner.rs
+++ replace <impl JobRunner for Closure<F>>::run -> Result<(), E> with Ok(())
@@ -83,13 +83,13 @@
 #[async_trait::async_trait]
 impl<E, F, Fut> JobRunner for Closure<F>
 where
     F: Send + Sync + Fn(Job) -> Fut,
     Fut: Future<Output = Result<(), E>> + Send,
 {
     type Error = E;
     async fn run(&self, job: Job) -> Result<(), E> {
-        (self.0)(job).await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub(crate) type BoxedJobRunner<E> = Box<dyn JobRunner<Error = E>>;

---- well_behaved stdout ----
thread 'well_behaved' panicked at tests/consumer.rs:194:34:
called `Result::unwrap()` on an `Err` value: IO(Custom { kind: UnexpectedEof, error: "early eof" })

---- terminate stdout ----
thread 'terminate' panicked at tests/consumer.rs:394:34:
called `Result::unwrap()` on an `Err` value: IO(Custom { kind: UnexpectedEof, error: "early eof" })

---- no_first_job stdout ----
thread 'no_first_job' panicked at tests/consumer.rs:259:34:
called `Result::unwrap()` on an `Err` value: IO(Custom { kind: UnexpectedEof, error: "early eof" })

failures:
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
