*** src/worker/state.rs:23:9: replace WorkerState::save_last_result with ()

*** mutation diff:
--- src/worker/state.rs
+++ replace WorkerState::save_last_result with ()
@@ -15,17 +15,17 @@
         self.last_job_result.take()
     }
 
     pub(crate) fn take_cuurently_running(&mut self) -> Option<JobId> {
         self.running_job.take()
     }
 
     pub(crate) fn save_last_result(&mut self, res: Result<JobId, Fail>) {
-        self.last_job_result = Some(res)
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub(crate) struct WorkerStatesRegistry(Vec<Mutex<WorkerState>>);
 
 impl Deref for WorkerStatesRegistry {
     type Target = Vec<Mutex<WorkerState>>;
     fn deref(&self) -> &Self::Target {

*** result: Success
