*** src/worker/state.rs:52:9: replace WorkerStatesRegistry::register_success with ()

*** mutation diff:
--- src/worker/state.rs
+++ replace WorkerStatesRegistry::register_success with ()
@@ -44,20 +44,17 @@
         Self((0..workers_count).map(|_| Default::default()).collect())
     }
 
     pub(crate) fn register_running(&self, worker: usize, jid: JobId) {
         self[worker].lock().expect("lock acquired").running_job = Some(jid);
     }
 
     pub(crate) fn register_success(&self, worker: usize, jid: JobId) {
-        self[worker]
-            .lock()
-            .expect("lock acquired")
-            .save_last_result(Ok(jid));
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn register_failure(&self, worker: usize, f: &Fail) {
         self[worker]
             .lock()
             .expect("lock acquired")
             .save_last_result(Err(f.clone()));
     }

*** result: Success
