*** src/worker/state.rs:66:9: replace WorkerStatesRegistry::reset with ()

*** mutation diff:
--- src/worker/state.rs
+++ replace WorkerStatesRegistry::reset with ()
@@ -58,13 +58,11 @@
     pub(crate) fn register_failure(&self, worker: usize, f: &Fail) {
         self[worker]
             .lock()
             .expect("lock acquired")
             .save_last_result(Err(f.clone()));
     }
 
     pub(crate) fn reset(&self, worker: usize) {
-        let mut state = self[worker].lock().expect("lock acquired");
-        state.last_job_result = None;
-        state.running_job = None;
+        () /* ~ changed by cargo-mutants ~ */
     }
 }

---- no_first_job stdout ----
thread 'no_first_job' panicked at tests/consumer.rs:259:5:
assertion `left == right` failed
  left: 1
 right: 0

---- well_behaved_many stdout ----
thread 'well_behaved_many' panicked at tests/consumer.rs:334:5:
assertion `left == right` failed
  left: 2
 right: 0

---- well_behaved stdout ----
thread 'well_behaved' panicked at tests/consumer.rs:194:5:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    no_first_job
    well_behaved
    well_behaved_many

test result: FAILED. 5 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.15s

*** result: Failure(101)
