*** src/bin/loadtest.rs:109:36: replace * with / in main

*** mutation diff:
--- src/bin/loadtest.rs
+++ replace * with / in main
@@ -101,17 +101,17 @@
 
     let mut _ops_count = Vec::with_capacity(threads);
     while let Some(res) = set.join_next().await {
         _ops_count.push(res.unwrap())
     }
 
     let stop = start.elapsed();
 
-    let stop_secs = stop.as_secs() * 1_000_000_000 + u64::from(stop.subsec_nanos());
+    let stop_secs = stop.as_secs() / /* ~ changed by cargo-mutants ~ */ 1_000_000_000 + u64::from(stop.subsec_nanos());
     let stop_secs = stop_secs as f64 / 1_000_000_000.0;
     println!(
         "Processed {} pushes and {} pops in {:.2} seconds, rate: {} jobs/s",
         pushed.load(atomic::Ordering::SeqCst),
         popped.load(atomic::Ordering::SeqCst),
         stop_secs,
         jobs as f64 / stop_secs,
     );

*** result: Success
