*** src/bin/loadtest.rs:78:24: replace % with / in main

*** mutation diff:
--- src/bin/loadtest.rs
+++ replace % with / in main
@@ -70,17 +70,17 @@
                 })
             });
             let mut c = c.connect(None).await.unwrap();
 
             let mut rng = rand::rngs::OsRng;
             let mut random_queues = Vec::from(QUEUES);
             random_queues.shuffle(&mut rng);
             for idx in 0..jobs {
-                if idx % 2 == 0 {
+                if idx / /* ~ changed by cargo-mutants ~ */ 2 == 0 {
                     // push
                     let mut job = Job::new(
                         "SomeJob",
                         vec![serde_json::Value::from(1), "string".into(), 3.into()],
                     );
                     job.priority = Some(rng.gen_range(1..10));
                     job.queue = QUEUES.choose(&mut rng).unwrap().to_string();
                     p.enqueue(job).await?;

*** result: Success
