*** src/bin/loadtest.rs:87:70: replace >= with < in main

*** mutation diff:
--- src/bin/loadtest.rs
+++ replace >= with < in main
@@ -79,17 +79,17 @@
                     // push
                     let mut job = Job::new(
                         "SomeJob",
                         vec![serde_json::Value::from(1), "string".into(), 3.into()],
                     );
                     job.priority = Some(rng.gen_range(1..10));
                     job.queue = QUEUES.choose(&mut rng).unwrap().to_string();
                     p.enqueue(job).await?;
-                    if pushed.fetch_add(1, atomic::Ordering::SeqCst) >= jobs {
+                    if pushed.fetch_add(1, atomic::Ordering::SeqCst) < /* ~ changed by cargo-mutants ~ */ jobs {
                         return Ok::<usize, Error>(idx);
                     }
                 } else {
                     // pop
                     c.run_one(0, &random_queues[..]).await?;
                     if popped.fetch_add(1, atomic::Ordering::SeqCst) >= jobs {
                         return Ok(idx);
                     }

*** result: Success
