*** src/proto/batch/status.rs:90:9: replace BatchStatus::open -> Result<Option<BatchHandle<'a, S>>, Error> with Ok(None)

*** mutation diff:
--- src/proto/batch/status.rs
+++ replace BatchStatus::open -> Result<Option<BatchHandle<'a, S>>, Error> with Ok(None)
@@ -82,11 +82,11 @@
 impl<'a> BatchStatus {
     /// Open the batch for which this `BatchStatus` has been retrieved.
     ///
     /// See [`open_batch`](Client::open_batch).
     pub async fn open<S: AsyncBufReadExt + AsyncWriteExt + Unpin + Send>(
         &self,
         prod: &'a mut Client<S>,
     ) -> Result<Option<BatchHandle<'a, S>>, Error> {
-        prod.open_batch(self.bid.clone()).await
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
