*** src/proto/client/ent.rs:11:9: replace Client<S>::set_progress -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/client/ent.rs
+++ replace Client<S>::set_progress -> Result<(), Error> with Ok(())
@@ -3,18 +3,17 @@
 use super::{Client, ReadToken};
 use crate::ent::{Batch, BatchHandle, BatchId};
 use crate::error::Error;
 use tokio::io::{AsyncBufReadExt, AsyncWriteExt};
 
 impl<S: AsyncBufReadExt + AsyncWriteExt + Unpin + Send> Client<S> {
     /// Send information on a job's execution progress to Faktory.
     pub async fn set_progress(&mut self, upd: ProgressUpdate) -> Result<(), Error> {
-        let cmd = Track::Set(upd);
-        self.issue(&cmd).await?.read_ok().await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Fetch information on a job's execution progress from Faktory.
     pub async fn get_progress(&mut self, jid: JobId) -> Result<Option<Progress>, Error> {
         let cmd = Track::Get(jid);
         self.issue(&cmd).await?.read_json().await
     }

*** result: Success
