*** src/proto/client/ent.rs:17:9: replace Client<S>::get_progress -> Result<Option<Progress>, Error> with Ok(None)

*** mutation diff:
--- src/proto/client/ent.rs
+++ replace Client<S>::get_progress -> Result<Option<Progress>, Error> with Ok(None)
@@ -9,18 +9,17 @@
     /// Send information on a job's execution progress to Faktory.
     pub async fn set_progress(&mut self, upd: ProgressUpdate) -> Result<(), Error> {
         let cmd = Track::Set(upd);
         self.issue(&cmd).await?.read_ok().await
     }
 
     /// Fetch information on a job's execution progress from Faktory.
     pub async fn get_progress(&mut self, jid: JobId) -> Result<Option<Progress>, Error> {
-        let cmd = Track::Get(jid);
-        self.issue(&cmd).await?.read_json().await
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Fetch information on a batch of jobs execution progress.
     pub async fn get_batch_status(&mut self, bid: BatchId) -> Result<Option<BatchStatus>, Error> {
         let cmd = GetBatchStatus::from(bid);
         self.issue(&cmd).await?.read_json().await
     }

*** result: Success
