*** src/proto/client/ent.rs:23:9: replace Client<S>::get_batch_status -> Result<Option<BatchStatus>, Error> with Ok(None)

*** mutation diff:
--- src/proto/client/ent.rs
+++ replace Client<S>::get_batch_status -> Result<Option<BatchStatus>, Error> with Ok(None)
@@ -15,18 +15,17 @@
     /// Fetch information on a job's execution progress from Faktory.
     pub async fn get_progress(&mut self, jid: JobId) -> Result<Option<Progress>, Error> {
         let cmd = Track::Get(jid);
         self.issue(&cmd).await?.read_json().await
     }
 
     /// Fetch information on a batch of jobs execution progress.
     pub async fn get_batch_status(&mut self, bid: BatchId) -> Result<Option<BatchStatus>, Error> {
-        let cmd = GetBatchStatus::from(bid);
-        self.issue(&cmd).await?.read_json().await
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Initiate a new batch of jobs.
     pub async fn start_batch(&mut self, batch: Batch) -> Result<BatchHandle<'_, S>, Error> {
         let bid = self.issue(&batch).await?.read_bid().await?;
         Ok(BatchHandle::new(bid, self))
     }

*** result: Success
