*** src/proto/client/ent.rs:43:9: replace Client<S>::commit_batch -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/client/ent.rs
+++ replace Client<S>::commit_batch -> Result<(), Error> with Ok(())
@@ -35,17 +35,17 @@
     /// This will not error if a batch with the provided `bid` does not exist,
     /// rather `Ok(None)` will be returned.
     pub async fn open_batch(&mut self, bid: BatchId) -> Result<Option<BatchHandle<'_, S>>, Error> {
         let bid = self.issue(&OpenBatch::from(bid)).await?.maybe_bid().await?;
         Ok(bid.map(|bid| BatchHandle::new(bid, self)))
     }
 
     pub(crate) async fn commit_batch(&mut self, bid: BatchId) -> Result<(), Error> {
-        self.issue(&CommitBatch::from(bid)).await?.read_ok().await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<'a, S: AsyncBufReadExt + AsyncWriteExt + Unpin + Send> ReadToken<'a, S> {
     pub(crate) async fn read_bid(self) -> Result<BatchId, Error> {
         single::read_bid(&mut self.0.stream).await
     }

*** result: Success
