*** src/proto/client/ent.rs:53:9: replace ReadToken<'a, S>::maybe_bid -> Result<Option<BatchId>, Error> with Ok(Some(Default::default()))

*** mutation diff:
--- src/proto/client/ent.rs
+++ replace ReadToken<'a, S>::maybe_bid -> Result<Option<BatchId>, Error> with Ok(Some(Default::default()))
@@ -45,25 +45,11 @@
 }
 
 impl<'a, S: AsyncBufReadExt + AsyncWriteExt + Unpin + Send> ReadToken<'a, S> {
     pub(crate) async fn read_bid(self) -> Result<BatchId, Error> {
         single::read_bid(&mut self.0.stream).await
     }
 
     pub(crate) async fn maybe_bid(self) -> Result<Option<BatchId>, Error> {
-        use crate::error;
-
-        let bid_read_res = single::read_bid(&mut self.0.stream).await;
-        if bid_read_res.is_ok() {
-            return Ok(Some(bid_read_res.unwrap()));
-        }
-        match bid_read_res.unwrap_err() {
-            Error::Protocol(error::Protocol::Internal { msg }) => {
-                if msg.starts_with("No such batch") {
-                    return Ok(None);
-                }
-                return Err(error::Protocol::Internal { msg }.into());
-            }
-            another => Err(another),
-        }
+        Ok(Some(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
