*** src/proto/client/mod.rs:164:9: replace Client<S>::reconnect -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/client/mod.rs
+++ replace Client<S>::reconnect -> Result<(), Error> with Ok(())
@@ -156,18 +156,17 @@
     S: AsyncBufReadExt + AsyncWriteExt + Unpin + Send + Reconnect,
 {
     pub(crate) async fn connect_again(&mut self) -> Result<Self, Error> {
         let s = self.stream.reconnect().await?;
         Client::new(s, self.opts.clone()).await
     }
 
     pub(crate) async fn reconnect(&mut self) -> Result<(), Error> {
-        self.stream = self.stream.reconnect().await?;
-        self.init().await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<S> Drop for Client<S>
 where
     S: AsyncBufReadExt + AsyncWriteExt + Unpin + Send,
 {
     fn drop(&mut self) {

*** result: Success
