*** src/proto/client/mod.rs:229:9: replace Client<S>::init -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/client/mod.rs
+++ replace Client<S>::init -> Result<(), Error> with Ok(())
@@ -221,53 +221,17 @@
     }
 }
 
 impl<S> Client<S>
 where
     S: AsyncBufReadExt + AsyncWriteExt + Unpin + Send,
 {
     async fn init(&mut self) -> Result<(), Error> {
-        let hi = single::read_hi(&mut self.stream).await?;
-        check_protocols_match(hi.version)?;
-
-        // fill in any missing options, and remember them for re-connect
-        let mut hello = single::Hello::default();
-
-        // prepare password hash, if one expected by 'Faktory'
-        if hi.salt.is_some() {
-            if let Some(ref pwd) = self.opts.password {
-                hello.set_password(&hi, pwd);
-            } else {
-                return Err(error::Connect::AuthenticationNeeded.into());
-            }
-        }
-
-        if self.opts.is_worker {
-            // fill in any missing options, and remember them for re-connect
-            let hostname = self
-                .opts
-                .hostname
-                .clone()
-                .or_else(|| hostname::get().ok()?.into_string().ok())
-                .unwrap_or_else(|| "local".to_string());
-            self.opts.hostname = Some(hostname);
-            let pid = self.opts.pid.unwrap_or_else(|| std::process::id() as usize);
-            self.opts.pid = Some(pid);
-            let wid = self.opts.wid.clone().unwrap_or_else(WorkerId::random);
-            self.opts.wid = Some(wid);
-
-            hello.hostname = Some(self.opts.hostname.clone().unwrap());
-            hello.wid = Some(self.opts.wid.clone().unwrap());
-            hello.pid = Some(self.opts.pid.unwrap());
-            hello.labels.clone_from(&self.opts.labels);
-        }
-
-        single::write_command_and_await_ok(&mut self.stream, &hello).await?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) async fn new(stream: S, opts: ClientOptions) -> Result<Client<S>, Error> {
         let mut c = Client { stream, opts };
         c.init().await?;
         Ok(c)
     }

---- hello stdout ----
thread 'hello' panicked at tests/consumer.rs:17:5:
assertion failed: written.starts_with(b"HELLO {")

---- dequeue stdout ----
Serialization(Error("expected value", line: 1, column: 1))
thread 'dequeue' panicked at tests/consumer.rs:85:9:
internal error: entered unreachable code

---- dequeue_first_empty stdout ----
Serialization(Error("expected value", line: 1, column: 1))
thread 'dequeue_first_empty' panicked at tests/consumer.rs:128:13:
internal error: entered unreachable code

failures:
    dequeue
    dequeue_first_empty
    hello
    hello_pwd
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
