*** src/proto/client/mod.rs:23:12: replace != with == in check_protocols_match

*** mutation diff:
--- src/proto/client/mod.rs
+++ replace != with == in check_protocols_match
@@ -15,17 +15,17 @@
 use tokio::net::TcpStream as TokioStream;
 
 mod options;
 pub(crate) use options::ClientOptions;
 
 pub(crate) const EXPECTED_PROTOCOL_VERSION: usize = 2;
 
 fn check_protocols_match(ver: usize) -> Result<(), Error> {
-    if ver != EXPECTED_PROTOCOL_VERSION {
+    if ver == /* ~ changed by cargo-mutants ~ */ EXPECTED_PROTOCOL_VERSION {
         return Err(error::Connect::VersionMismatch {
             ours: EXPECTED_PROTOCOL_VERSION,
             theirs: ver,
         }
         .into());
     }
     Ok(())
 }

*** result: Failure(101)
