*** src/proto/client/mod.rs:23:5: replace check_protocols_match -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/client/mod.rs
+++ replace check_protocols_match -> Result<(), Error> with Ok(())
@@ -15,24 +15,17 @@
 use tokio::net::TcpStream as TokioStream;
 
 mod options;
 pub(crate) use options::ClientOptions;
 
 pub(crate) const EXPECTED_PROTOCOL_VERSION: usize = 2;
 
 fn check_protocols_match(ver: usize) -> Result<(), Error> {
-    if ver != EXPECTED_PROTOCOL_VERSION {
-        return Err(error::Connect::VersionMismatch {
-            ours: EXPECTED_PROTOCOL_VERSION,
-            theirs: ver,
-        }
-        .into());
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// `Client` is used to enqueue new jobs that will in turn be processed by Faktory workers.
 ///
 /// # Connecting to Faktory
 ///
 /// To issue jobs, the `Client` must first be connected to the Faktory server. Exactly how you do
 /// that depends on your setup. Faktory suggests using the `FAKTORY_PROVIDER` and `FAKTORY_URL`

*** result: Success
