*** src/proto/client/mod.rs:326:9: replace Client<S>::enqueue -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/client/mod.rs
+++ replace Client<S>::enqueue -> Result<(), Error> with Ok(())
@@ -318,17 +318,17 @@
 impl<S> Client<S>
 where
     S: AsyncBufReadExt + AsyncWriteExt + Unpin + Send,
 {
     /// Asynchronously enqueue the given job on the Faktory server.
     ///
     /// Returns `Ok` if the job was successfully queued by the Faktory server.
     pub async fn enqueue(&mut self, job: Job) -> Result<(), Error> {
-        self.issue(&Push::from(job)).await?.read_ok().await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Enqueue numerous jobs on the Faktory server.
     ///
     /// Provided you have numerous jobs to submit, using this method will be more efficient as compared
     /// to calling [`enqueue`](Client::enqueue) multiple times.
     ///
     /// The returned `Ok` result will contain a tuple of enqueued jobs count and an option of a hash map

---- enqueue stdout ----
thread 'enqueue' panicked at tests/producer.rs:54:5:
assertion failed: written.starts_with(b"PUSH {")

failures:
    enqueue

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
