*** src/proto/client/mod.rs:348:9: replace Client<S>::enqueue_many -> Result<(usize, Option<HashMap<String, String>>), Error> with Ok((0, Some(HashMap::new())))

*** mutation diff:
--- src/proto/client/mod.rs
+++ replace Client<S>::enqueue_many -> Result<(usize, Option<HashMap<String, String>>), Error> with Ok((0, Some(HashMap::new())))
@@ -340,28 +340,17 @@
     pub async fn enqueue_many<J>(
         &mut self,
         jobs: J,
     ) -> Result<(usize, Option<HashMap<String, String>>), Error>
     where
         J: IntoIterator<Item = Job>,
         J::IntoIter: ExactSizeIterator,
     {
-        let jobs = jobs.into_iter();
-        let jobs_count = jobs.len();
-        let errors: HashMap<String, String> = self
-            .issue(&PushBulk::from(jobs.collect::<Vec<_>>()))
-            .await?
-            .read_json()
-            .await?
-            .expect("Faktory server sends {} literal when there are no errors");
-        if errors.is_empty() {
-            return Ok((jobs_count, None));
-        }
-        Ok((jobs_count - errors.len(), Some(errors)))
+        Ok((0, Some(HashMap::new()))) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Retrieve information about the running server.
     ///
     /// The returned value is the result of running the `INFO` command on the server.
     pub async fn info(&mut self) -> Result<serde_json::Value, Error> {
         self.issue(&Info)
             .await?

*** result: Success
