*** src/proto/client/mod.rs:378:9: replace Client<S>::queue_pause -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/client/mod.rs
+++ replace Client<S>::queue_pause -> Result<(), Error> with Ok(())
@@ -370,20 +370,17 @@
             .map(|v| v.expect("info command cannot give empty response"))
     }
 
     /// Pause the given queues.
     pub async fn queue_pause<Q>(&mut self, queues: &[Q]) -> Result<(), Error>
     where
         Q: AsRef<str> + Sync,
     {
-        self.issue(&QueueControl::new(QueueAction::Pause, queues))
-            .await?
-            .read_ok()
-            .await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Resume the given queues.
     pub async fn queue_resume<Q>(&mut self, queues: &[Q]) -> Result<(), Error>
     where
         Q: AsRef<str> + Sync,
     {
         self.issue(&QueueControl::new(QueueAction::Resume, queues))

---- queue_control stdout ----
thread 'queue_control' panicked at tests/producer.rs:100:5:
assertion failed: written == b"QUEUE PAUSE test test2\r\nQUEUE RESUME test3 test4\r\n"

failures:
    queue_control

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
