*** src/proto/client/mod.rs:402:9: replace ReadToken<'a, S>::read_ok -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/client/mod.rs
+++ replace ReadToken<'a, S>::read_ok -> Result<(), Error> with Ok(())
@@ -394,17 +394,17 @@
 }
 
 pub struct ReadToken<'a, S>(pub(crate) &'a mut Client<S>)
 where
     S: AsyncBufReadExt + AsyncWriteExt + Unpin + Send;
 
 impl<'a, S: AsyncBufReadExt + AsyncWriteExt + Unpin + Send> ReadToken<'a, S> {
     pub(crate) async fn read_ok(self) -> Result<(), Error> {
-        single::read_ok(&mut self.0.stream).await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) async fn read_json<T>(self) -> Result<Option<T>, Error>
     where
         T: serde::de::DeserializeOwned,
     {
         single::read_json(&mut self.0.stream).await
     }

*** result: Success
