*** src/proto/client/mod.rs:409:9: replace ReadToken<'a, S>::read_json -> Result<Option<T>, Error> with Ok(None)

*** mutation diff:
--- src/proto/client/mod.rs
+++ replace ReadToken<'a, S>::read_json -> Result<Option<T>, Error> with Ok(None)
@@ -401,11 +401,11 @@
     pub(crate) async fn read_ok(self) -> Result<(), Error> {
         single::read_ok(&mut self.0.stream).await
     }
 
     pub(crate) async fn read_json<T>(self) -> Result<Option<T>, Error>
     where
         T: serde::de::DeserializeOwned,
     {
-        single::read_json(&mut self.0.stream).await
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 }

---- dequeue_first_empty stdout ----
thread 'dequeue_first_empty' panicked at tests/consumer.rs:133:25:
assertion failed: did_work

---- dequeue stdout ----
thread 'dequeue' panicked at tests/consumer.rs:89:5:
assertion `left == right` failed
  left: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10]
 right: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]

---- terminate stdout ----
thread 'terminate' panicked at tests/consumer.rs:394:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    dequeue
    dequeue_first_empty
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 2 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.19s

*** result: Failure(101)
