*** src/proto/single/cmd.rs:250:9: replace <impl FaktoryCommand for Push>::issue -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/single/cmd.rs
+++ replace <impl FaktoryCommand for Push>::issue -> Result<(), Error> with Ok(())
@@ -242,20 +242,17 @@
     fn from(j: Job) -> Self {
         Push(j)
     }
 }
 
 #[async_trait::async_trait]
 impl FaktoryCommand for Push {
     async fn issue<W: AsyncWriteExt + Unpin + Send>(&self, w: &mut W) -> Result<(), Error> {
-        w.write_all(b"PUSH ").await?;
-        let r = serde_json::to_vec(&**self).map_err(Error::Serialization)?;
-        w.write_all(&r).await?;
-        Ok(w.write_all(b"\r\n").await?)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ---------------------- PUSHB -------------------
 
 pub(crate) struct PushBulk(Vec<Job>);
 
 impl From<Vec<Job>> for PushBulk {

---- enqueue stdout ----
thread 'enqueue' panicked at tests/producer.rs:54:5:
assertion failed: written.starts_with(b"PUSH {")

failures:
    enqueue

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
