*** src/proto/single/cmd.rs:270:9: replace <impl FaktoryCommand for PushBulk>::issue -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/single/cmd.rs
+++ replace <impl FaktoryCommand for PushBulk>::issue -> Result<(), Error> with Ok(())
@@ -262,20 +262,17 @@
     fn from(jobs: Vec<Job>) -> Self {
         PushBulk(jobs)
     }
 }
 
 #[async_trait::async_trait]
 impl FaktoryCommand for PushBulk {
     async fn issue<W: AsyncWriteExt + Unpin + Send>(&self, w: &mut W) -> Result<(), Error> {
-        w.write_all(b"PUSHB ").await?;
-        let r = serde_json::to_vec(&self.0).map_err(Error::Serialization)?;
-        w.write_all(&r).await?;
-        Ok(w.write_all(b"\r\n").await?)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ---------------------- QUEUE -------------------
 
 pub(crate) enum QueueAction {
     Pause,
     Resume,

*** result: Success
