*** src/proto/single/cmd.rs:48:9: replace <impl FaktoryCommand for Info>::issue -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/single/cmd.rs
+++ replace <impl FaktoryCommand for Info>::issue -> Result<(), Error> with Ok(())
@@ -40,17 +40,17 @@
 
 // -------------------- INFO ----------------------
 
 pub(crate) struct Info;
 
 #[async_trait::async_trait]
 impl FaktoryCommand for Info {
     async fn issue<W: AsyncWriteExt + Unpin + Send>(&self, w: &mut W) -> Result<(), Error> {
-        Ok(w.write_all(b"INFO\r\n").await?)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // -------------------- ACK ----------------------
 
 #[derive(Serialize)]
 pub(crate) struct Ack {
     jid: JobId,

*** result: Success
