*** src/proto/single/id.rs:43:9: replace JobId::random -> Self with Default::default()

*** mutation diff:
--- src/proto/single/id.rs
+++ replace JobId::random -> Self with Default::default()
@@ -35,17 +35,17 @@
 /// If you do not have any domain, product or organisation specific requirements, you may prefer
 /// to have a random job identifier generated for you with [`random`](JobId::random).
 #[derive(Debug, Clone, Default, PartialEq, Eq, Serialize, Deserialize)]
 pub struct JobId(String);
 
 impl JobId {
     /// Internally, generates a 16-char long random ASCII string.
     pub fn random() -> Self {
-        Self(utils::gen_random_jid())
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 string_wrapper_impls!(JobId);
 
 // -----------------------------------------------------
 
 /// Worker identifier.

---- proto::single::test::test_all_job_creation_variants_align stdout ----
thread 'proto::single::test::test_all_job_creation_variants_align' panicked at src/proto/single/mod.rs:337:9:
assertion `left != right` failed
  left: JobId("")
 right: JobId("")

---- proto::single::test::test_job_can_be_created_with_builder stdout ----
thread 'proto::single::test::test_job_can_be_created_with_builder' panicked at src/proto/single/mod.rs:292:9:
assertion failed: job.jid != "".into()

failures:
    proto::single::test::test_all_job_creation_variants_align
    proto::single::test::test_job_can_be_created_with_builder

test result: FAILED. 33 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.25s

*** result: Failure(101)
