*** src/proto/single/id.rs:64:9: replace WorkerId::random -> Self with Default::default()

*** mutation diff:
--- src/proto/single/id.rs
+++ replace WorkerId::random -> Self with Default::default()
@@ -56,17 +56,17 @@
 /// If you do not have any domain, product or organisation specific requirements, you may prefer
 /// to have a random job identifier generated for you with [`random`](WorkerId::random).
 #[derive(Debug, Clone, Default, PartialEq, Eq, Serialize, Deserialize)]
 pub struct WorkerId(String);
 
 impl WorkerId {
     /// Internally, generates a 32-char long random ASCII string.
     pub fn random() -> Self {
-        Self(utils::gen_random_wid())
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 string_wrapper_impls!(WorkerId);
 
 // -----------------------------------------------------
 
 /// Batch identifier.

*** result: Success
