*** src/proto/single/id.rs:84:9: replace <impl From for Value>::from -> Self with Default::default()

*** mutation diff:
--- src/proto/single/id.rs
+++ replace <impl From for Value>::from -> Self with Default::default()
@@ -76,11 +76,11 @@
 #[derive(Debug, Clone, Default, PartialEq, Eq, Serialize, Deserialize)]
 pub struct BatchId(String);
 
 string_wrapper_impls!(BatchId);
 
 use serde_json::Value;
 impl From<BatchId> for Value {
     fn from(value: BatchId) -> Self {
-        value.0.into()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
