*** src/proto/single/mod.rs:260:9: replace Job::failure -> &Option<Failure> with &None

*** mutation diff:
--- src/proto/single/mod.rs
+++ replace Job::failure -> &Option<Failure> with &None
@@ -252,17 +252,17 @@
 
     /// The arguments provided for this job.
     pub fn args(&self) -> &[serde_json::Value] {
         &self.args
     }
 
     /// Data about this job's most recent failure.
     pub fn failure(&self) -> &Option<Failure> {
-        &self.failure
+        &None /* ~ changed by cargo-mutants ~ */
     }
 }
 pub async fn write_command<W: AsyncWriteExt + Unpin + Send, C: FaktoryCommand>(
     w: &mut W,
     command: &C,
 ) -> Result<(), Error> {
     command.issue::<W>(w).await?;
     Ok(w.flush().await?)

*** result: Success
