*** src/proto/single/mod.rs:278:5: replace write_command_and_await_ok -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/proto/single/mod.rs
+++ replace write_command_and_await_ok -> Result<(), Error> with Ok(())
@@ -270,18 +270,17 @@
 
 pub async fn write_command_and_await_ok<
     S: AsyncBufRead + AsyncWriteExt + Unpin + Send,
     C: FaktoryCommand,
 >(
     stream: &mut S,
     command: &C,
 ) -> Result<(), Error> {
-    write_command(stream, command).await?;
-    read_ok(stream).await
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod test {
     use super::*;
 
     #[test]
     fn test_job_can_be_created_with_builder() {

---- dequeue stdout ----
thread 'dequeue' panicked at tests/consumer.rs:89:5:
assertion `left == right` failed
  left: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10]
 right: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]

---- hello stdout ----
thread 'hello' panicked at tests/consumer.rs:17:5:
assertion failed: written.starts_with(b"HELLO {")

---- dequeue_first_empty stdout ----
thread 'dequeue_first_empty' panicked at tests/consumer.rs:133:25:
assertion failed: did_work

failures:
    dequeue
    dequeue_first_empty
    hello
    hello_pwd
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 0 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.14s

*** result: Failure(101)
