*** src/proto/single/resp.rs:172:29: replace - with + in read

*** mutation diff:
--- src/proto/single/resp.rs
+++ replace - with + in read
@@ -164,17 +164,17 @@
         }
         b':' => {
             // Integer
             // https://redis.io/topics/protocol#resp-integers
             let mut s = String::with_capacity(32);
             r.read_line(&mut s).await?;
 
             // remove newlines
-            let l = s.len() - 2;
+            let l = s.len() + /* ~ changed by cargo-mutants ~ */ 2;
             s.truncate(l);
 
             match (*s).parse::<isize>() {
                 Ok(i) => Ok(RawResponse::Number(i)),
                 Err(_) => Err(error::Protocol::BadResponse {
                     typed_as: "integer",
                     error: "invalid integer value",
                     bytes: s.into_bytes(),

---- proto::single::resp::test::it_parses_numbers stdout ----
thread 'proto::single::resp::test::it_parses_numbers' panicked at src/proto/single/resp.rs:277:34:
called `Result::unwrap()` on an `Err` value: Protocol(BadResponse { typed_as: "integer", error: "invalid integer value", bytes: [49, 48, 50, 52, 13, 10] })

---- proto::single::resp::test::json_error_on_number stdout ----
thread 'proto::single::resp::test::json_error_on_number' panicked at src/proto/single/resp.rs:417:13:
internal error: entered unreachable code

failures:
    proto::single::resp::test::it_parses_numbers
    proto::single::resp::test::json_error_on_number

test result: FAILED. 33 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.02s

*** result: Failure(101)
