*** src/proto/single/resp.rs:190:63: replace - with / in read

*** mutation diff:
--- src/proto/single/resp.rs
+++ replace - with / in read
@@ -182,17 +182,17 @@
                 .into()),
             }
         }
         b'$' => {
             // Bulk String
             // https://redis.io/topics/protocol#resp-bulk-strings
             let mut bytes = Vec::with_capacity(32);
             r.read_until(b'\n', &mut bytes).await?;
-            let s = std::str::from_utf8(&bytes[0..bytes.len() - 2]).map_err(|_| {
+            let s = std::str::from_utf8(&bytes[0..bytes.len() / /* ~ changed by cargo-mutants ~ */ 2]).map_err(|_| {
                 error::Protocol::BadResponse {
                     typed_as: "bulk string",
                     error: "server bulk response contains non-utf8 size prefix",
                     bytes: bytes[0..bytes.len() - 2].to_vec(),
                 }
             })?;
 
             let size = s

---- dequeue stdout ----
Serialization(Error("EOF while parsing a string", line: 1, column: 18))
thread 'dequeue' panicked at tests/consumer.rs:85:9:
internal error: entered unreachable code

---- dequeue_first_empty stdout ----
Serialization(Error("EOF while parsing a string", line: 1, column: 18))
thread 'dequeue_first_empty' panicked at tests/consumer.rs:136:13:
internal error: entered unreachable code

---- well_behaved stdout ----
thread 'well_behaved' panicked at tests/consumer.rs:194:34:
called `Result::unwrap()` on an `Err` value: Serialization(Error("EOF while parsing a string", line: 1, column: 18))

failures:
    dequeue
    dequeue_first_empty
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 2 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
