*** src/proto/single/resp.rs:37:5: replace read_json -> Result<Option<T>, Error> with Ok(None)

*** mutation diff:
--- src/proto/single/resp.rs
+++ replace read_json -> Result<Option<T>, Error> with Ok(None)
@@ -29,42 +29,17 @@
     }
 }
 
 // ----------------------------------------------
 
 pub async fn read_json<R: AsyncBufReadExt + Unpin, T: serde::de::DeserializeOwned>(
     r: R,
 ) -> Result<Option<T>, Error> {
-    let rr = read(r).await?;
-    match rr {
-        RawResponse::String(ref s) if s == "OK" => {
-            return Ok(None);
-        }
-        RawResponse::String(ref s) => {
-            return serde_json::from_str(s)
-                .map(Some)
-                .map_err(Error::Serialization);
-        }
-        RawResponse::Blob(ref b) if b == b"OK" => {
-            return Ok(None);
-        }
-        RawResponse::Blob(ref b) => {
-            if b.is_empty() {
-                return Ok(None);
-            }
-            return serde_json::from_slice(b)
-                .map(Some)
-                .map_err(Error::Serialization);
-        }
-        RawResponse::Null => return Ok(None),
-        _ => {}
-    };
-
-    Err(bad("json", &rr).into())
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 // ----------------------------------------------
 
 #[cfg(feature = "ent")]
 pub async fn read_bid<R: AsyncBufReadExt + Unpin>(r: R) -> Result<BatchId, Error> {
     match read(r).await? {
         RawResponse::Blob(ref b) if b.is_empty() => Err(error::Protocol::BadType {

---- proto::single::resp::test::it_errors_on_unknown_resp_type stdout ----
thread 'proto::single::resp::test::it_errors_on_unknown_resp_type' panicked at src/proto/single/resp.rs:401:33:
called `Result::unwrap_err()` on an `Ok` value: None

---- proto::single::resp::test::it_decodes_blob_json stdout ----
thread 'proto::single::resp::test::it_decodes_blob_json' panicked at src/proto/single/resp.rs:358:9:
assertion `left == right` failed
  left: None
 right: Some(Object {"hello": Number(1)})

---- proto::single::resp::test::it_errors_on_bad_json_string stdout ----
thread 'proto::single::resp::test::it_errors_on_bad_json_string' panicked at src/proto/single/resp.rs:374:63:
called `Result::unwrap_err()` on an `Ok` value: None

failures:
    proto::single::resp::test::it_decodes_blob_json
    proto::single::resp::test::it_decodes_string_json
    proto::single::resp::test::it_errors_on_bad_json_blob
    proto::single::resp::test::it_errors_on_bad_json_string
    proto::single::resp::test::it_errors_on_unknown_resp_type
    proto::single::resp::test::json_error_on_number

test result: FAILED. 29 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.20s

*** result: Failure(101)
