*** src/proto/single/resp.rs:39:41: replace == with != in read_json

*** mutation diff:
--- src/proto/single/resp.rs
+++ replace == with != in read_json
@@ -31,17 +31,17 @@
 
 // ----------------------------------------------
 
 pub async fn read_json<R: AsyncBufReadExt + Unpin, T: serde::de::DeserializeOwned>(
     r: R,
 ) -> Result<Option<T>, Error> {
     let rr = read(r).await?;
     match rr {
-        RawResponse::String(ref s) if s == "OK" => {
+        RawResponse::String(ref s) if s != /* ~ changed by cargo-mutants ~ */ "OK" => {
             return Ok(None);
         }
         RawResponse::String(ref s) => {
             return serde_json::from_str(s)
                 .map(Some)
                 .map_err(Error::Serialization);
         }
         RawResponse::Blob(ref b) if b == b"OK" => {

---- proto::single::resp::test::it_decodes_json_ok_string stdout ----
thread 'proto::single::resp::test::it_decodes_json_ok_string' panicked at src/proto/single/resp.rs:349:39:
called `Result::unwrap()` on an `Err` value: Serialization(Error("expected value", line: 1, column: 1))

---- proto::single::resp::test::it_errors_on_bad_json_string stdout ----
thread 'proto::single::resp::test::it_errors_on_bad_json_string' panicked at src/proto/single/resp.rs:399:63:
called `Result::unwrap_err()` on an `Ok` value: None

---- proto::single::resp::test::it_decodes_string_json stdout ----
thread 'proto::single::resp::test::it_decodes_string_json' panicked at src/proto/single/resp.rs:375:9:
assertion `left == right` failed
  left: None
 right: Some(Object {"hello": Number(1)})

failures:
    proto::single::resp::test::it_decodes_json_ok_string
    proto::single::resp::test::it_decodes_string_json
    proto::single::resp::test::it_errors_on_bad_json_string

test result: FAILED. 32 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.14s

*** result: Failure(101)
