*** src/proto/single/resp.rs:69:5: replace read_bid -> Result<BatchId, Error> with Ok(Default::default())

*** mutation diff:
--- src/proto/single/resp.rs
+++ replace read_bid -> Result<BatchId, Error> with Ok(Default::default())
@@ -61,30 +61,17 @@
 
     Err(bad("json", &rr).into())
 }
 
 // ----------------------------------------------
 
 #[cfg(feature = "ent")]
 pub async fn read_bid<R: AsyncBufReadExt + Unpin>(r: R) -> Result<BatchId, Error> {
-    match read(r).await? {
-        RawResponse::Blob(ref b) if b.is_empty() => Err(error::Protocol::BadType {
-            expected: "non-empty blob representation of batch id",
-            received: "empty blob".into(),
-        }
-        .into()),
-        RawResponse::Blob(ref b) => Ok(std::str::from_utf8(b)
-            .map_err(|_| error::Protocol::BadType {
-                expected: "valid blob representation of batch id",
-                received: "unprocessable blob".into(),
-            })?
-            .into()),
-        something_else => Err(bad("id", &something_else).into()),
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 // ----------------------------------------------
 
 #[derive(Serialize, Deserialize, Debug, Eq, PartialEq, Ord, PartialOrd, Hash)]
 pub struct Hi {
     #[serde(rename = "v")]
     pub version: usize,

*** result: Success
