*** src/proto/single/utils.rs:19:5: replace gen_random_wid -> String with String::new()

*** mutation diff:
--- src/proto/single/utils.rs
+++ replace gen_random_wid -> String with String::new()
@@ -11,17 +11,17 @@
         .collect()
 }
 
 pub(crate) fn gen_random_jid() -> String {
     gen_random_id(JOB_ID_LENGTH)
 }
 
 pub(crate) fn gen_random_wid() -> String {
-    gen_random_id(WORKER_ID_LENGTH)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod test {
     use super::*;
     use std::collections::HashSet;
 
     #[test]

*** result: Success
