*** src/proto/utils.rs:11:5: replace host_from_url -> String with "xyzzy".into()

*** mutation diff:
--- src/proto/utils.rs
+++ replace host_from_url -> String with "xyzzy".into()
@@ -3,17 +3,17 @@
 
 pub(crate) fn get_env_url() -> String {
     use std::env;
     let var = env::var("FAKTORY_PROVIDER").unwrap_or_else(|_| "FAKTORY_URL".to_string());
     env::var(var).unwrap_or_else(|_| "tcp://localhost:7419".to_string())
 }
 
 pub(crate) fn host_from_url(url: &Url) -> String {
-    format!("{}:{}", url.host_str().unwrap(), url.port().unwrap_or(7419))
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn url_parse(url: &str) -> Result<Url, Error> {
     let url = Url::parse(url).map_err(error::Connect::ParseUrl)?;
     if url.scheme() != "tcp" {
         return Err(error::Connect::BadScheme {
             scheme: url.scheme().to_string(),
         }

---- proto::utils::tests::url_port_default stdout ----
thread 'proto::utils::tests::url_port_default' panicked at src/proto/utils.rs:61:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "example.com:7419"

failures:
    proto::utils::tests::url_port_default

test result: FAILED. 34 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.01s

*** result: Failure(101)
