*** src/proto/utils.rs:23:33: replace || with && in url_parse

*** mutation diff:
--- src/proto/utils.rs
+++ replace || with && in url_parse
@@ -15,17 +15,17 @@
     let url = Url::parse(url).map_err(error::Connect::ParseUrl)?;
     if url.scheme() != "tcp" {
         return Err(error::Connect::BadScheme {
             scheme: url.scheme().to_string(),
         }
         .into());
     }
 
-    if url.host_str().is_none() || url.host_str().unwrap().is_empty() {
+    if url.host_str().is_none() && /* ~ changed by cargo-mutants ~ */ url.host_str().unwrap().is_empty() {
         return Err(error::Connect::MissingHostname.into());
     }
 
     Ok(url)
 }
 
 pub(crate) fn parse_provided_or_from_env(url: Option<&str>) -> Result<Url, Error> {
     url_parse(url.unwrap_or(&get_env_url()))

*** result: Success
