*** src/proto/utils.rs:5:5: replace get_env_url -> String with "xyzzy".into()

*** mutation diff:
--- src/proto/utils.rs
+++ replace get_env_url -> String with "xyzzy".into()
@@ -1,15 +1,13 @@
 use crate::error::{self, Error};
 use url::Url;
 
 pub(crate) fn get_env_url() -> String {
-    use std::env;
-    let var = env::var("FAKTORY_PROVIDER").unwrap_or_else(|_| "FAKTORY_URL".to_string());
-    env::var(var).unwrap_or_else(|_| "tcp://localhost:7419".to_string())
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn host_from_url(url: &Url) -> String {
     format!("{}:{}", url.host_str().unwrap(), url.port().unwrap_or(7419))
 }
 
 pub(crate) fn url_parse(url: &str) -> Result<Url, Error> {
     let url = Url::parse(url).map_err(error::Connect::ParseUrl)?;

---- proto::utils::tests::correct_env_parsing stdout ----
thread 'proto::utils::tests::correct_env_parsing' panicked at src/proto/utils.rs:45:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "tcp://localhost:7419"

failures:
    proto::utils::tests::correct_env_parsing

test result: FAILED. 34 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.11s

*** result: Failure(101)
