*** src/worker/builder.rs:37:9: replace WorkerBuilder<E>::hostname -> &mut Self with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- src/worker/builder.rs
+++ replace WorkerBuilder<E>::hostname -> &mut Self with Box::leak(Box::new(Default::default()))
@@ -29,18 +29,17 @@
     }
 }
 
 impl<E: 'static> WorkerBuilder<E> {
     /// Set the hostname to use for this worker.
     ///
     /// Defaults to the machine's hostname as reported by the operating system.
     pub fn hostname(&mut self, hn: String) -> &mut Self {
-        self.opts.hostname = Some(hn);
-        self
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set a unique identifier for this worker.
     ///
     /// Defaults to a randomly generated 32-char ASCII string.
     pub fn wid(&mut self, wid: WorkerId) -> &mut Self {
         self.opts.wid = Some(wid);
         self

---- hello stdout ----
thread 'hello' panicked at tests/consumer.rs:20:5:
assertion `left == right` failed
  left: Some("rustworthy")
 right: Some("host")

failures:
    hello

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.14s

*** result: Failure(101)
