*** src/worker/builder.rs:45:9: replace WorkerBuilder<E>::wid -> &mut Self with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- src/worker/builder.rs
+++ replace WorkerBuilder<E>::wid -> &mut Self with Box::leak(Box::new(Default::default()))
@@ -37,18 +37,17 @@
         self.opts.hostname = Some(hn);
         self
     }
 
     /// Set a unique identifier for this worker.
     ///
     /// Defaults to a randomly generated 32-char ASCII string.
     pub fn wid(&mut self, wid: WorkerId) -> &mut Self {
-        self.opts.wid = Some(wid);
-        self
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set the labels to use for this worker.
     ///
     /// Defaults to `["rust"]`.
     pub fn labels(&mut self, labels: Vec<String>) -> &mut Self {
         self.opts.labels = labels;
         self

---- hello stdout ----
thread 'hello' panicked at tests/consumer.rs:24:5:
assertion `left == right` failed
  left: Some("q6lWpCTRo57ozNjWw9yMFxwfNbVyJV0m")
 right: Some("wid")

---- terminate stdout ----
thread 'terminate' panicked at tests/consumer.rs:399:5:
assertion `left == right` failed
  left: [66, 69, 65, 84, 32, 123, 34, 119, 105, 100, 34, 58, 34, 79, 65, 49, 86, 81, 100, 76, 86, 122, 49, 102, 81]
 right: [66, 69, 65, 84, 32, 123, 34, 119, 105, 100, 34, 58, 34, 119, 105, 100, 34, 125, 13, 10, 70, 65, 73, 76, 32]

---- well_behaved stdout ----
thread 'well_behaved' panicked at tests/consumer.rs:202:5:
assertion `left == right` failed
  left: "BEAT {\"wid\":\"Db2LIvTEgAaMRhrnM500Dj89asdK4k7n\"}\r\nBEAT {\"wid\":\"Db2LIvTEgAaMRhrnM500Dj89asdK4k7n\"}\r\nEND\r\n"
 right: "BEAT {\"wid\":\"wid\"}\r\nBEAT {\"wid\":\"wid\"}\r\nEND\r\n"

failures:
    hello
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 3 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.14s

*** result: Failure(101)
