*** src/worker/builder.rs:53:9: replace WorkerBuilder<E>::labels -> &mut Self with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- src/worker/builder.rs
+++ replace WorkerBuilder<E>::labels -> &mut Self with Box::leak(Box::new(Default::default()))
@@ -45,18 +45,17 @@
         self.opts.wid = Some(wid);
         self
     }
 
     /// Set the labels to use for this worker.
     ///
     /// Defaults to `["rust"]`.
     pub fn labels(&mut self, labels: Vec<String>) -> &mut Self {
-        self.opts.labels = labels;
-        self
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Set the number of workers to use `run` and `run_to_completion`.
     ///
     /// Defaults to 1.
     pub fn workers(&mut self, w: usize) -> &mut Self {
         self.workers_count = w;
         self

---- hello stdout ----
thread 'hello' panicked at tests/consumer.rs:28:5:
assertion `left == right` failed
  left: [String("rust")]
 right: ["foo", "bar"]

failures:
    hello

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.14s

*** result: Failure(101)
