*** src/worker/builder.rs:61:9: replace WorkerBuilder<E>::workers -> &mut Self with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- src/worker/builder.rs
+++ replace WorkerBuilder<E>::workers -> &mut Self with Box::leak(Box::new(Default::default()))
@@ -53,18 +53,17 @@
         self.opts.labels = labels;
         self
     }
 
     /// Set the number of workers to use `run` and `run_to_completion`.
     ///
     /// Defaults to 1.
     pub fn workers(&mut self, w: usize) -> &mut Self {
-        self.workers_count = w;
-        self
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Register a handler function for the given job type (`kind`).
     ///
     /// Whenever a job whose type matches `kind` is fetched from the Faktory, the given handler
     /// function is called with that job as its argument.
     pub fn register<K, H, Fut>(&mut self, kind: K, handler: H) -> &mut Self
     where

*** result: Failure(101)
