*** src/worker/health.rs:28:23: replace == with != in Worker<S, E>::listen_for_heartbeats

*** mutation diff:
--- src/worker/health.rs
+++ replace == with != in Worker<S, E>::listen_for_heartbeats
@@ -20,17 +20,17 @@
         let mut target = STATUS_RUNNING;
 
         let mut last = time::Instant::now();
 
         loop {
             tokio_sleep(time::Duration::from_millis(100)).await;
 
             // has a worker failed?
-            if target == STATUS_RUNNING
+            if target != /* ~ changed by cargo-mutants ~ */ STATUS_RUNNING
                 && statuses
                     .iter()
                     .any(|s| s.load(atomic::Ordering::SeqCst) == STATUS_TERMINATING)
             {
                 // tell all workers to exit
                 // (though chances are they've all failed already)
                 for s in statuses {
                     s.store(STATUS_TERMINATING, atomic::Ordering::SeqCst);

---- well_behaved stdout ----
thread 'well_behaved' panicked at tests/consumer.rs:202:5:
assertion `left == right` failed
  left: "BEAT {\"wid\":\"wid\"}\r\nEND\r\n"
 right: "BEAT {\"wid\":\"wid\"}\r\nBEAT {\"wid\":\"wid\"}\r\nEND\r\n"

---- well_behaved_many stdout ----
thread 'well_behaved_many' panicked at tests/consumer.rs:342:5:
assertion `left == right` failed
  left: "BEAT {\"wid\":\"wid\"}\r\nEND\r\n"
 right: "BEAT {\"wid\":\"wid\"}\r\nBEAT {\"wid\":\"wid\"}\r\nEND\r\n"

---- no_first_job stdout ----
thread 'no_first_job' panicked at tests/consumer.rs:267:5:
assertion `left == right` failed
  left: "BEAT {\"wid\":\"wid\"}\r\nEND\r\n"
 right: "BEAT {\"wid\":\"wid\"}\r\nBEAT {\"wid\":\"wid\"}\r\nEND\r\n"

failures:
    no_first_job
    well_behaved
    well_behaved_many

test result: FAILED. 5 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.11s

*** result: Failure(101)
