*** src/worker/health.rs:31:63: replace == with != in Worker<S, E>::listen_for_heartbeats

*** mutation diff:
--- src/worker/health.rs
+++ replace == with != in Worker<S, E>::listen_for_heartbeats
@@ -23,17 +23,17 @@
 
         loop {
             tokio_sleep(time::Duration::from_millis(100)).await;
 
             // has a worker failed?
             if target == STATUS_RUNNING
                 && statuses
                     .iter()
-                    .any(|s| s.load(atomic::Ordering::SeqCst) == STATUS_TERMINATING)
+                    .any(|s| s.load(atomic::Ordering::SeqCst) != /* ~ changed by cargo-mutants ~ */ STATUS_TERMINATING)
             {
                 // tell all workers to exit
                 // (though chances are they've all failed already)
                 for s in statuses {
                     s.store(STATUS_TERMINATING, atomic::Ordering::SeqCst);
                 }
                 break Ok(false);
             }

*** result: Timeout
