*** src/worker/mod.rs:148:9: replace Worker<S, E>::reconnect -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/worker/mod.rs
+++ replace Worker<S, E>::reconnect -> Result<(), Error> with Ok(())
@@ -140,17 +140,17 @@
     c: Client<S>,
     worker_states: Arc<state::WorkerStatesRegistry>,
     callbacks: Arc<CallbacksRegistry<E>>,
     terminated: bool,
 }
 
 impl<S: AsyncBufReadExt + AsyncWriteExt + Send + Unpin + Reconnect, E> Worker<S, E> {
     async fn reconnect(&mut self) -> Result<(), Error> {
-        self.c.reconnect().await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<S: AsyncBufReadExt + AsyncWriteExt + Send + Unpin, E> Worker<S, E> {
     async fn new(c: Client<S>, workers_count: usize, callbacks: CallbacksRegistry<E>) -> Self {
         Worker {
             c,
             callbacks: Arc::new(callbacks),

*** result: Success
