*** src/worker/mod.rs:182:9: replace Worker<S, E>::report_success_to_server -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/worker/mod.rs
+++ replace Worker<S, E>::report_success_to_server -> Result<(), Error> with Ok(())
@@ -174,17 +174,17 @@
         handler.run(job).await.map_err(Failed::Application)
     }
 
     async fn report_failure_to_server(&mut self, f: &Fail) -> Result<(), Error> {
         self.c.issue(f).await?.read_ok().await
     }
 
     async fn report_success_to_server(&mut self, jid: JobId) -> Result<(), Error> {
-        self.c.issue(&Ack::new(jid)).await?.read_ok().await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn report_on_all_workers(&mut self) -> Result<(), Error> {
         let worker_states = Arc::get_mut(&mut self.worker_states)
             .expect("all workers are scoped to &mut of the user-code-visible Worker");
 
         // retry delivering notification about our last job result.
         // we know there's no leftover thread at this point, so there's no race on the option.

---- dequeue_first_empty stdout ----
thread 'dequeue_first_empty' panicked at tests/consumer.rs:141:5:
assertion `left == right` failed
  left: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10]
 right: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]

---- dequeue stdout ----
thread 'dequeue' panicked at tests/consumer.rs:89:5:
assertion `left == right` failed
  left: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10]
 right: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]

---- no_first_job stdout ----
thread 'no_first_job' panicked at tests/consumer.rs:276:5:
assertion `left == right` failed
  left: "ls\":[\"rust\"],\"v\":2}\r\nFETCH default\r\nFETCH default\r\nEND\r\n"
 right: "\r\nFETCH default\r\nFETCH default\r\nACK {\"jid\":\"jid\"}\r\nEND\r\n"

failures:
    dequeue
    dequeue_first_empty
    no_first_job
    well_behaved
    well_behaved_many

test result: FAILED. 3 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.14s

*** result: Failure(101)
