*** src/worker/mod.rs:186:9: replace Worker<S, E>::report_on_all_workers -> Result<(), Error> with Ok(())

*** mutation diff:
--- src/worker/mod.rs
+++ replace Worker<S, E>::report_on_all_workers -> Result<(), Error> with Ok(())
@@ -178,51 +178,17 @@
         self.c.issue(f).await?.read_ok().await
     }
 
     async fn report_success_to_server(&mut self, jid: JobId) -> Result<(), Error> {
         self.c.issue(&Ack::new(jid)).await?.read_ok().await
     }
 
     async fn report_on_all_workers(&mut self) -> Result<(), Error> {
-        let worker_states = Arc::get_mut(&mut self.worker_states)
-            .expect("all workers are scoped to &mut of the user-code-visible Worker");
-
-        // retry delivering notification about our last job result.
-        // we know there's no leftover thread at this point, so there's no race on the option.
-        for wstate in worker_states.iter_mut() {
-            let wstate = wstate.get_mut().unwrap();
-            if let Some(res) = wstate.take_last_result() {
-                let r = match res {
-                    Ok(ref jid) => self.c.issue(&Ack::new(jid.clone())).await,
-                    Err(ref fail) => self.c.issue(fail).await,
-                };
-
-                let r = match r {
-                    Ok(r) => r,
-                    Err(e) => {
-                        wstate.save_last_result(res);
-                        return Err(e);
-                    }
-                };
-
-                if let Err(e) = r.read_ok().await {
-                    // it could be that the server did previously get our ACK/FAIL, and that it was
-                    // the resulting OK that failed. in that case, we would get an error response
-                    // when re-sending the job response. this should not count as critical. other
-                    // errors, however, should!
-                    if let Error::IO(_) = e {
-                        wstate.save_last_result(res);
-                        return Err(e);
-                    }
-                }
-            }
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     // FAIL currently running jobs even though they're still running.
     // Returns the number of workers that may still be processing jobs.
     // We are ignoring any FAIL command issue errors, since this is already
     // an "emergency" case.
     async fn force_fail_all_workers(&mut self) -> usize {
         let mut running = 0;

*** result: Success
