*** src/worker/mod.rs:249:9: replace Worker<S, E>::run_one -> Result<bool, Error> with Ok(true)

*** mutation diff:
--- src/worker/mod.rs
+++ replace Worker<S, E>::run_one -> Result<bool, Error> with Ok(true)
@@ -241,43 +241,17 @@
         running
     }
 
     /// Fetch and run a single job, and then return.
     pub async fn run_one<Q>(&mut self, worker: usize, queues: &[Q]) -> Result<bool, Error>
     where
         Q: AsRef<str> + Sync,
     {
-        let job = match self.c.fetch(queues).await? {
-            None => return Ok(false),
-            Some(j) => j,
-        };
-
-        let jid = job.jid.clone();
-
-        self.worker_states.register_running(worker, jid.clone());
-
-        match self.run_job(job).await {
-            Ok(_) => {
-                self.worker_states.register_success(worker, jid.clone());
-                self.report_success_to_server(jid).await?;
-            }
-            Err(e) => {
-                let fail = match e {
-                    Failed::BadJobType(jt) => Fail::generic(jid, format!("No handler for {}", jt)),
-                    Failed::Application(e) => Fail::generic_with_backtrace(jid, e),
-                };
-                self.worker_states.register_failure(worker, &fail);
-                self.report_failure_to_server(&fail).await?;
-            }
-        }
-
-        self.worker_states.reset(worker);
-
-        Ok(true)
+        Ok(true) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<
         S: AsyncBufReadExt + AsyncWriteExt + Reconnect + Send + Unpin + 'static,
         E: StdError + 'static + Send,
     > Worker<S, E>
 {

---- dequeue_first_empty stdout ----
thread 'dequeue_first_empty' panicked at tests/consumer.rs:125:25:
assertion failed: !did_work

---- dequeue stdout ----
thread 'dequeue' panicked at tests/consumer.rs:89:5:
assertion `left == right` failed
  left: []
 right: [70, 69, 84, 67, 72, 32, 100, 101, 102, 97, 117, 108, 116, 13, 10, 65, 67, 75, 32, 123, 34, 106, 105, 100, 34, 58, 34, 102, 111, 111, 106, 105, 100, 34, 125, 13, 10]

---- terminate stdout ----
thread 'terminate' panicked at tests/consumer.rs:394:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    dequeue
    dequeue_first_empty
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 2 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.13s

*** result: Failure(101)
