*** src/worker/mod.rs:305:57: replace == with != in Worker<S, E>::spawn_worker

*** mutation diff:
--- src/worker/mod.rs
+++ replace == with != in Worker<S, E>::spawn_worker
@@ -297,17 +297,17 @@
         queues: &[Q],
     ) -> Result<JoinHandle<Result<(), Error>>, Error>
     where
         Q: AsRef<str>,
     {
         let mut w = self.for_worker().await?;
         let queues: Vec<_> = queues.iter().map(|s| s.as_ref().to_string()).collect();
         Ok(tokio::spawn(async move {
-            while status.load(atomic::Ordering::SeqCst) == STATUS_RUNNING {
+            while status.load(atomic::Ordering::SeqCst) != /* ~ changed by cargo-mutants ~ */ STATUS_RUNNING {
                 if let Err(e) = w.run_one(worker, &queues[..]).await {
                     status.store(STATUS_TERMINATING, atomic::Ordering::SeqCst);
                     return Err(e);
                 }
             }
             status.store(STATUS_TERMINATING, atomic::Ordering::SeqCst);
             Ok(())
         }))

---- well_behaved stdout ----
thread 'well_behaved' panicked at tests/consumer.rs:202:5:
assertion `left == right` failed
  left: "END\r\n"
 right: "BEAT {\"wid\":\"wid\"}\r\nBEAT {\"wid\":\"wid\"}\r\nEND\r\n"

---- terminate stdout ----
thread 'terminate' panicked at tests/consumer.rs:394:5:
assertion `left == right` failed
  left: 0
 right: 1

---- well_behaved_many stdout ----
thread 'well_behaved_many' panicked at tests/consumer.rs:342:5:
assertion `left == right` failed
  left: "END\r\n"
 right: "BEAT {\"wid\":\"wid\"}\r\nBEAT {\"wid\":\"wid\"}\r\nEND\r\n"

failures:
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
