*** src/worker/mod.rs:328:9: replace Worker<S, E>::run -> Result<usize, Error> with Ok(1)

*** mutation diff:
--- src/worker/mod.rs
+++ replace Worker<S, E>::run -> Result<usize, Error> with Ok(1)
@@ -320,62 +320,17 @@
     ///
     /// If an error occurred while reporting a job success or failure, the result will be re-reported to the server
     /// without re-executing the job. If the worker was terminated (i.e., `run` returns  with an `Ok` response),
     /// the worker should **not** try to resume by calling `run` again. This will cause a panic.
     pub async fn run<Q>(&mut self, queues: &[Q]) -> Result<usize, Error>
     where
         Q: AsRef<str>,
     {
-        assert!(!self.terminated, "do not re-run a terminated worker");
-        self.report_on_all_workers().await?;
-
-        let workers_count = self.worker_states.len();
-
-        // keep track of the current status of each worker
-        let statuses: Vec<_> = (0..workers_count)
-            .map(|_| Arc::new(atomic::AtomicUsize::new(STATUS_RUNNING)))
-            .collect();
-
-        let mut workers = Vec::with_capacity(workers_count);
-        for (worker, status) in statuses.iter().enumerate().take(workers_count) {
-            let handle = self
-                .spawn_worker(Arc::clone(status), worker, queues)
-                .await?;
-            workers.push(handle)
-        }
-
-        let exit = self.listen_for_heartbeats(&statuses).await;
-
-        // there are a couple of cases here:
-        //
-        //  - we got TERMINATE, so we should just return, even if a worker is still running
-        //  - we got TERMINATE and all workers has exited
-        //  - we got an error from heartbeat()
-        //
-        self.terminated = exit.is_ok();
-
-        if let Ok(true) = exit {
-            let running = self.force_fail_all_workers().await;
-            if running != 0 {
-                return Ok(running);
-            }
-        }
-
-        // we want to expose worker errors, or otherwise the heartbeat error
-        let mut results = Vec::with_capacity(workers_count);
-        for w in workers {
-            results.push(w.await.expect("joined ok"));
-        }
-        let result = results.into_iter().collect::<Result<Vec<_>, _>>();
-
-        match exit {
-            Ok(_) => result.map(|_| 0),
-            Err(e) => result.and(Err(e)),
-        }
+        Ok(1) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Run this worker until the server tells us to exit or a connection cannot be re-established.
     ///
     /// This function never returns. When the worker decides to exit, the process is terminated.
     pub async fn run_to_completion<Q>(mut self, queues: &[Q]) -> !
     where
         Q: AsRef<str>,

*** result: Failure(101)
