*** src/worker/state.rs:15:9: replace WorkerState::take_last_result -> Option<Result<JobId, Fail>> with Some(Ok(Default::default()))

*** mutation diff:
--- src/worker/state.rs
+++ replace WorkerState::take_last_result -> Option<Result<JobId, Fail>> with Some(Ok(Default::default()))
@@ -7,17 +7,17 @@
 #[derive(Default)]
 pub(crate) struct WorkerState {
     last_job_result: Option<Result<JobId, Fail>>,
     running_job: Option<JobId>,
 }
 
 impl WorkerState {
     pub(crate) fn take_last_result(&mut self) -> Option<Result<JobId, Fail>> {
-        self.last_job_result.take()
+        Some(Ok(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn take_cuurently_running(&mut self) -> Option<JobId> {
         self.running_job.take()
     }
 
     pub(crate) fn save_last_result(&mut self, res: Result<JobId, Fail>) {
         self.last_job_result = Some(res)

*** result: Timeout
