*** src/worker/state.rs:19:9: replace WorkerState::take_cuurently_running -> Option<JobId> with None

*** mutation diff:
--- src/worker/state.rs
+++ replace WorkerState::take_cuurently_running -> Option<JobId> with None
@@ -11,17 +11,17 @@
 }
 
 impl WorkerState {
     pub(crate) fn take_last_result(&mut self) -> Option<Result<JobId, Fail>> {
         self.last_job_result.take()
     }
 
     pub(crate) fn take_cuurently_running(&mut self) -> Option<JobId> {
-        self.running_job.take()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn save_last_result(&mut self, res: Result<JobId, Fail>) {
         self.last_job_result = Some(res)
     }
 }
 
 pub(crate) struct WorkerStatesRegistry(Vec<Mutex<WorkerState>>);

*** result: Timeout
