*** src/worker/state.rs:19:9: replace WorkerState::take_cuurently_running -> Option<JobId> with Some(Default::default())

*** mutation diff:
--- src/worker/state.rs
+++ replace WorkerState::take_cuurently_running -> Option<JobId> with Some(Default::default())
@@ -11,17 +11,17 @@
 }
 
 impl WorkerState {
     pub(crate) fn take_last_result(&mut self) -> Option<Result<JobId, Fail>> {
         self.last_job_result.take()
     }
 
     pub(crate) fn take_cuurently_running(&mut self) -> Option<JobId> {
-        self.running_job.take()
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn save_last_result(&mut self, res: Result<JobId, Fail>) {
         self.last_job_result = Some(res)
     }
 }
 
 pub(crate) struct WorkerStatesRegistry(Vec<Mutex<WorkerState>>);

---- terminate stdout ----
{"jid":"","errtype":"unknown","message":"terminated"}
thread 'terminate' panicked at tests/consumer.rs:408:5:
assertion `left == right` failed
  left: Some("")
 right: Some("forever")

---- well_behaved_many stdout ----
thread 'well_behaved_many' panicked at tests/consumer.rs:334:5:
assertion `left == right` failed
  left: 2
 right: 0

---- well_behaved stdout ----
thread 'well_behaved' panicked at tests/consumer.rs:194:5:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    no_first_job
    terminate
    well_behaved
    well_behaved_many

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.14s

*** result: Failure(101)
