*** src/worker/state.rs:38:9: replace <impl DerefMut for WorkerStatesRegistry>::deref_mut -> &mut Self::Target with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- src/worker/state.rs
+++ replace <impl DerefMut for WorkerStatesRegistry>::deref_mut -> &mut Self::Target with Box::leak(Box::new(Default::default()))
@@ -30,17 +30,17 @@
     type Target = Vec<Mutex<WorkerState>>;
     fn deref(&self) -> &Self::Target {
         &self.0
     }
 }
 
 impl DerefMut for WorkerStatesRegistry {
     fn deref_mut(&mut self) -> &mut Self::Target {
-        &mut self.0
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl WorkerStatesRegistry {
     pub(crate) fn new(workers_count: usize) -> Self {
         Self((0..workers_count).map(|_| Default::default()).collect())
     }

*** result: Success
