*** src/worker/state.rs:48:9: replace WorkerStatesRegistry::register_running with ()

*** mutation diff:
--- src/worker/state.rs
+++ replace WorkerStatesRegistry::register_running with ()
@@ -40,17 +40,17 @@
 }
 
 impl WorkerStatesRegistry {
     pub(crate) fn new(workers_count: usize) -> Self {
         Self((0..workers_count).map(|_| Default::default()).collect())
     }
 
     pub(crate) fn register_running(&self, worker: usize, jid: JobId) {
-        self[worker].lock().expect("lock acquired").running_job = Some(jid);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn register_success(&self, worker: usize, jid: JobId) {
         self[worker]
             .lock()
             .expect("lock acquired")
             .save_last_result(Ok(jid));
     }

*** result: Timeout
