*** src/worker/state.rs:59:9: replace WorkerStatesRegistry::register_failure with ()

*** mutation diff:
--- src/worker/state.rs
+++ replace WorkerStatesRegistry::register_failure with ()
@@ -51,20 +51,17 @@
     pub(crate) fn register_success(&self, worker: usize, jid: JobId) {
         self[worker]
             .lock()
             .expect("lock acquired")
             .save_last_result(Ok(jid));
     }
 
     pub(crate) fn register_failure(&self, worker: usize, f: &Fail) {
-        self[worker]
-            .lock()
-            .expect("lock acquired")
-            .save_last_result(Err(f.clone()));
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn reset(&self, worker: usize) {
         let mut state = self[worker].lock().expect("lock acquired");
         state.last_job_result = None;
         state.running_job = None;
     }
 }

*** result: Success
